{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "conv2d_1",
            "trainable": true,
            "batch_input_shape": [
              null,
              224,
              224,
              3
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last",
            "name": "max_pooling2d_1",
            "trainable": true
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 2,
            "activation": "softmax",
            "use_bias": true,
            "name": "classification",
            "trainable": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "model.weights.bin"
      ],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "classification/kernel",
          "shape": [
            25088,
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "classification/bias",
          "shape": [
            2
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "format": "tfjs_layers_model",
  "generatedBy": "TensorFlow.js v4.2.0",
  "convertedBy": null,
  "signature": null,
  "userDefinedMetadata": {
    "metadata": {
      "modelName": "my-image-model",
      "timeStamp": "2025-11-11T08:49:56.716Z",
      "labels": [
        "sakis",
        "no sakis"
      ],
      "userMetadata": {},
      "modelSettings": {
        "inputImageHeight": 224,
        "inputImageWidth": 224,
        "inputImageChannels": 3
      }
    },
    "examples": {
      "sakis": {
        "inferences": [
          0.014070247299969196,
          0,
          0,
          0.030178528279066086,
          0,
          0,
          0.061323460191488266,
          0,
          0.016781602054834366,
          0.08864395320415497,
          0.02735726721584797,
          0.0036963459569960833,
          0.007577226031571627,
          0.00009743383998284116,
          0.0025787134654819965,
          0.0008113198564387858,
          0.013536157086491585,
          0.046351075172424316,
          0.04500863328576088,
          0.007115331944078207,
          0.0010426767403259873,
          0.007559796795248985,
          0.003755916142836213,
          0.003307354636490345,
          0.008047085255384445,
          0.010881021618843079,
          0,
          0.0010601436952129006,
          0.024506377056241035,
          0,
          0.009774495847523212,
          0.02282068505883217,
          0.0011420096270740032,
          0.03205987811088562,
          0.00021589809330180287,
          0.0009811739437282085,
          0.0343761220574379,
          0.006737592164427042,
          0,
          0.002969438908621669,
          0.0267295204102993,
          0.009298515506088734,
          0.007204647641628981,
          0,
          0.014725658111274242,
          0.006145344581454992,
          0.009011739864945412,
          0.00813903659582138,
          0.002217522356659174,
          0,
          0.00639061676338315,
          0.002854130929335952,
          0.11988916993141174,
          0.005015982780605555,
          0.013555002398788929,
          0.013546121306717396,
          0.03981457278132439,
          0.0005900897085666656,
          0.026682676747441292,
          0.008996279910206795,
          0.0002219059388153255,
          0.05254495143890381,
          0.05571720004081726,
          0.015400695614516735,
          0.0034682927653193474,
          0.0170650165528059,
          0.00029146045562811196,
          0,
          0.010646426118910313,
          0.0003405603929422796,
          0.0556425079703331,
          0.03835473582148552,
          0,
          0.00726130697876215,
          0.0020217096898704767,
          0.054098546504974365,
          0.06275828927755356,
          0.02843952365219593,
          0.0006099740276113153,
          0.0008616728591732681,
          0.011030316352844238,
          0.005057896953076124,
          0.0001674096565693617,
          0,
          0.003993845544755459,
          0,
          0.011847516521811485,
          0,
          0.00023486075224354863,
          0,
          0.01949531026184559,
          0.03164570778608322,
          0.0008079757099039853,
          0.028623398393392563,
          0.0016123036621138453,
          0,
          0.0006381669081747532,
          0,
          0.005511549301445484,
          0.030788479372859,
          0.015154924243688583,
          0.12830977141857147,
          0.07831493020057678,
          0.01757173426449299,
          0.005292723421007395,
          0.020836064592003822,
          0.01037013903260231,
          0.00193271622993052,
          0.02409854531288147,
          0.017363818362355232,
          0.06403487175703049,
          0.012655199505388737,
          0.0005073574720881879,
          0.003953424748033285,
          0.02299966849386692,
          0.06415998935699463,
          0.03167635574936867,
          0.01589091122150421,
          0,
          0.0005564477178268135,
          0,
          0.031730473041534424,
          0.0053925225511193275,
          0.046142589300870895,
          0.007485769689083099,
          0.05478227883577347,
          0.015112831257283688,
          0.016786664724349976,
          0.0011803339002653956,
          0.008836605586111546,
          0.0004931387957185507,
          0.038753632456064224,
          0,
          0.008361617103219032,
          0,
          0,
          0.007673368789255619,
          0.023149583488702774,
          0,
          0.017842000350356102,
          0.01764780282974243,
          0,
          0.03294050320982933,
          0,
          0,
          0.05639934167265892,
          0.001137580256909132,
          0.009047339670360088,
          0.019093740731477737,
          0.00006774756184313446,
          0.004690920934081078,
          0.05114070326089859,
          0.04440416768193245,
          0.0006465400219894946,
          0.0002235167339676991,
          0.0010363028850406408,
          0.008679731748998165,
          0.06152427941560745,
          0.041223976761102676,
          0.012150750495493412,
          0.008379128761589527,
          0,
          0.023393405601382256,
          0.06087842583656311,
          0,
          0.05476946756243706,
          0,
          0.007111778948456049,
          0.005469888914376497,
          0.015455671586096287,
          0.0015864359447732568,
          0.017735566943883896,
          0.06523706763982773,
          0.0070047201588749886,
          0,
          0.013645184226334095,
          0,
          0.0006723263650201261,
          0.030156230553984642,
          0.00032314835698343813,
          0.0013577115023508668,
          0.006049528252333403,
          0,
          0.05447779595851898,
          0.04008692130446434,
          0.022653430700302124,
          0.005974595434963703,
          0.05836344510316849,
          0,
          0.031205840408802032,
          0.003299407195299864,
          0.005225080065429211,
          0.019956612959504128,
          0.047356296330690384,
          0.017612410709261894,
          0.007913392968475819,
          0.024345386773347855,
          0.00008323933434439823,
          0.0041555496864020824,
          0.04724348708987236,
          0.003322864882647991,
          0.03196047618985176,
          0.0017987334867939353,
          0.00191794044803828,
          0.00045321742072701454,
          0.004956445656716824,
          0.0008731758571229875,
          0,
          0.030140969902276993,
          0.00206884928047657,
          0.0004707680200226605,
          0.009235519915819168,
          0.016530899330973625,
          0.027763284742832184,
          0.01828797161579132,
          0.015051659196615219,
          0.010199769400060177,
          0.0015552041586488485,
          0.012264513410627842,
          0.017212247475981712,
          0.018404964357614517,
          0.016006577759981155,
          0.007571707013994455,
          0.00455629825592041,
          0.0016878481255844235,
          0.04106530547142029,
          0.0025339412968605757,
          0.006770418956875801,
          0.0453186072409153,
          0.0029462568927556276,
          0.03731227293610573,
          0.08501831442117691,
          0.013103757053613663,
          0.00022793754760641605,
          0.008449993096292019,
          0.005876216571778059,
          0.0018912197556346655,
          0,
          0.009189214557409286,
          0.004708371125161648,
          0,
          0.06964728236198425,
          0,
          0.0020096078515052795,
          0.017393631860613823,
          0.002288841875270009,
          0.003169245785102248,
          0.009192942641675472,
          0.043908677995204926,
          0.02320861630141735,
          0.015064542181789875,
          0.022323403507471085,
          0.005276856943964958,
          0.001964735798537731,
          0.0001460344938095659,
          0.0018235654570162296,
          0.0009832379873842,
          0.003647247329354286,
          0,
          0.02598022297024727,
          0.10051993280649185,
          0.0002445958089083433,
          0.013628475368022919,
          0.02811622805893421,
          0.11380241811275482,
          0,
          0.022244570776820183,
          0.00634461035951972,
          0.005313239060342312,
          0.006288471631705761,
          0.04063468426465988,
          0.03610509634017944,
          0.02361289970576763,
          0.0030060349963605404,
          0.027949104085564613,
          0.06003720313310623,
          0.08477126806974411,
          0.014318282715976238,
          0.004816472064703703,
          0.005875431001186371,
          0.04408080503344536,
          0.0023240449372678995,
          0.021747998893260956,
          0.01993638649582863,
          0.004046466667205095,
          0.00399738596752286,
          0.018180593848228455,
          0,
          0.005483884364366531,
          0.0037015285342931747,
          0.033839885145425797,
          0.0015930489171296358,
          0.005226598121225834,
          0,
          0.03685656934976578,
          0,
          0.05138629302382469,
          0,
          0.017679383978247643,
          0.0029718964360654354,
          0.0008575358660891652,
          0.004526829347014427,
          0.003079249057918787,
          0,
          0.00015083682956174016,
          0.010306168347597122,
          0.011911177076399326,
          0.00008590891229687259,
          0.03694688528776169,
          0.0015662985388189554,
          0,
          0.062099605798721313,
          0.004378344863653183,
          0.07291869819164276,
          0.003657432971522212,
          0.09531933814287186,
          0.011477322317659855,
          0,
          0.06579611450433731,
          0,
          0.0014843893004581332,
          0,
          0.000017040540114976466,
          0.003435921622440219,
          0.0008471874753013253,
          0.008659271523356438,
          0.015493135899305344,
          0,
          0.03498714417219162,
          0,
          0.06368554383516312,
          0.043024711310863495,
          0,
          0.004964359104633331,
          0.026345519348978996,
          0.002485087839886546,
          0.013954050838947296,
          0,
          0.02002696320414543,
          0.030658256262540817,
          0.03031003288924694,
          0.03520854562520981,
          0.08523642271757126,
          0.011548214592039585,
          0,
          0,
          0.003069824306294322,
          0,
          0.04092693328857422,
          0.08810041099786758,
          0.07666902244091034,
          0.02175196073949337,
          0.0289317537099123,
          0.0008384375832974911,
          0,
          0,
          0,
          0.016142625361680984,
          0.031831420958042145,
          0.0029395287856459618,
          0,
          0.01216526422649622,
          0.028817705810070038,
          0,
          0.0010946713155135512,
          0,
          0.031854622066020966,
          0.004367972258478403,
          0.010936271399259567,
          0.0007166477153077722,
          0.000493989500682801,
          0.030619163066148758,
          0,
          0.003816724056378007,
          0.000857011298649013,
          0.0198074821382761,
          0.004750346299260855,
          0.00037117803003638983,
          0,
          0,
          0.0004500139912124723,
          0.0034789028577506542,
          0.011868619360029697,
          0.041414275765419006,
          0.002174031687900424,
          0.011481105349957943,
          0.003781032282859087,
          0.011623705737292767,
          0.03966839984059334,
          0.00033725149114616215,
          0.04343792051076889,
          0.0004916450125165284,
          0.0017928017769008875,
          0.021882450208067894,
          0.004874936304986477,
          0.019859233871102333,
          0.008180246688425541,
          0.0179289598017931,
          0.038868073374032974,
          0,
          0.0046547832898795605,
          0.003889164188876748,
          0.032007794827222824,
          0.030837200582027435,
          0.07959842681884766,
          0.003479091916233301,
          0.016894569620490074,
          0.021746093407273293,
          0.0443311482667923,
          0,
          0.00011977378017036244,
          0,
          0,
          0.00900309532880783,
          0.007000918034464121,
          0.014068043790757656,
          0.0007855744333937764,
          0.002716351067647338,
          0.004083781037479639,
          0.008512908592820168,
          0.026156442239880562,
          0.003422423033043742,
          0,
          0.04698561131954193,
          0,
          0.02982948161661625,
          0.030975786969065666,
          0.041865274310112,
          0.011293201707303524,
          0.007504424545913935,
          0.0022634160704910755,
          0,
          0.010356873273849487,
          0.01163546647876501,
          0.01819699816405773,
          0,
          0.0012890411308035254,
          0.007621388882398605,
          0.001957533648237586,
          0.0013318925630301237,
          0.004173404071480036,
          0,
          0,
          0.01232205517590046,
          0.010787364095449448,
          0.06267230957746506,
          0.0008212336106225848,
          0,
          0.000003964238203479908,
          0,
          0,
          0,
          0.014883286319673061,
          0.00863137748092413,
          0.003794417716562748,
          0.0056975120678544044,
          0.021635089069604874,
          0.0506763681769371,
          0.006953106261789799,
          0.06356370449066162,
          0.009643923491239548,
          0.03025049716234207,
          0.019601047039031982,
          0.013605757616460323,
          0,
          0.009497351944446564,
          0.027360429987311363,
          0,
          0.0000531068944837898,
          0.06621874123811722,
          0.02448573149740696,
          0.03140391781926155,
          0,
          0.0972968190908432,
          0.003903113305568695,
          0.015520586632192135,
          0.032836612313985825,
          0.014994420111179352,
          0,
          0.0015223483787849545,
          0,
          0.0354936309158802,
          0.013920002616941929,
          0.04089643806219101,
          0,
          0.002398938639089465,
          0.011116757988929749,
          0,
          0.004282881505787373,
          0.030989423394203186,
          0.026408521458506584,
          0.007572457194328308,
          0.051529575139284134,
          0.002202848671004176,
          0.005652260966598988,
          0.0036584532354027033,
          0.001137184677645564,
          0.029720118269324303,
          0.055764053016901016,
          0.02427338808774948,
          0.06345437467098236,
          0.00048444390995427966,
          0.02033967711031437,
          0.012072608806192875,
          0.011055543087422848,
          0.06550023704767227,
          0.01345795951783657,
          0.0017103218706324697,
          0.036096442490816116,
          0.03826267272233963,
          0.0041539790108799934,
          0.03923574462532997,
          0,
          0.009295928291976452,
          0.009312944486737251,
          0.02103513292968273,
          0.020258821547031403,
          0.02240596152842045,
          0.004129363223910332,
          0,
          0.0010652273194864392,
          0.029878780245780945,
          0.025400716811418533,
          0.04489260911941528,
          0,
          0.007360171526670456,
          0.015514598228037357,
          0.02168525755405426,
          0.0029417697805911303,
          0.018879448994994164,
          0,
          0.0017439627554267645,
          0.03984901309013367,
          0.04542035982012749,
          0,
          0.010573497042059898,
          0.012581918388605118,
          0.02900056354701519,
          0.0897441953420639,
          0.06126520782709122,
          0.0029905056580901146,
          0.03561842814087868,
          0.0021359266247600317,
          0.013401494361460209,
          0.015096073970198631,
          0.06335747987031937,
          0.008286213502287865,
          0.006031110417097807,
          0.0010394167620688677,
          0.011570772156119347,
          0.005829992704093456,
          0.013889186084270477,
          0.0011466324795037508,
          0.007563192397356033,
          0.010901876725256443,
          0.0021723799873143435,
          0.023674454540014267,
          0.0019231276819482446,
          0.027648163959383965,
          0.07264728844165802,
          0.015714891254901886,
          0.0027931751683354378,
          0.01448290329426527,
          0.0013814532430842519,
          0,
          0.01651173084974289,
          0,
          0.020707163959741592,
          0.0036258655600249767,
          0.015220221132040024,
          0.0007051261491142213,
          0.006723522208631039,
          0,
          0.009813439100980759,
          0.020829522982239723,
          0.01085157971829176,
          0.003930795472115278,
          0,
          0.0012683128006756306,
          0.023351900279521942,
          0.0013308011693879962,
          0,
          0.0067729526199400425,
          0.07225693017244339,
          0.007482787128537893,
          0.019394150003790855,
          0.03853533789515495,
          0,
          0.007799580227583647,
          0.0015290193259716034,
          0,
          0.013830107636749744,
          0.0031793650705367327,
          0.09627769887447357,
          0.03619801253080368,
          0.015019453130662441,
          0,
          0.05944911763072014,
          0.0013663191348314285,
          0.016858594492077827,
          0.0016654501669108868,
          0.030549099668860435,
          0.0016547715058550239,
          0.008567293174564838,
          0.05574102699756622,
          0.022752894088625908,
          0.0013586340937763453,
          0,
          0,
          0.011740431189537048,
          0.009767002426087856,
          0.025174470618367195,
          0.01664971001446247,
          0,
          0.00020384861272759736,
          0.029323361814022064,
          0.0012533292174339294,
          0.021926945075392723,
          0.015237309969961643,
          0.009498465806245804,
          0.008002317510545254,
          0,
          0,
          0.017227552831172943,
          0.024320542812347412,
          0.00035308426595292985,
          0.004957216791808605,
          0.03828529268503189,
          0.0032512482721358538,
          0.05799184739589691,
          0.01726297289133072,
          0.020439548417925835,
          0.01731332391500473,
          0.044794224202632904,
          0.0034621511586010456,
          0.04564272239804268,
          0.02817714773118496,
          0.012976862490177155,
          0.005339260678738356,
          0.0049784486182034016,
          0.006949704606086016,
          0.037735939025878906,
          0.021925680339336395,
          0.006904863752424717,
          0.03024129383265972,
          0.019744541496038437,
          0.03683421015739441,
          0.04904573783278465,
          0.033511362969875336,
          0.00021126405044924468,
          0.03797981142997742,
          0.008447383530437946,
          0.0013687071623280644,
          0.03735709190368652,
          0.025427287444472313,
          0.005318444687873125,
          0.04012478515505791,
          0.0140471700578928,
          0.00012483801401685923,
          0.001734444871544838,
          0.02766919694840908,
          0.00015064995386637747,
          0.017356162890791893,
          0.011886795982718468,
          0.026817021891474724,
          0,
          0.013338658027350903,
          0.002355351112782955,
          0,
          0.03520170599222183,
          0.01441663596779108,
          0.0033503405284136534,
          0,
          0.017544373869895935,
          0.000749041500966996,
          0,
          0.031135335564613342,
          0.02507200464606285,
          0.01720018871128559,
          0.005030650645494461,
          0,
          0.010052938014268875,
          0.00413660891354084,
          0,
          0.003523636143654585,
          0,
          0.09083995968103409,
          0,
          0.00927996076643467,
          0.0014851950109004974,
          0.06695893406867981,
          0.009134921245276928,
          0.03307504951953888,
          0.04482690617442131,
          0.01404228713363409,
          0.055185478180646896,
          0,
          0,
          0.0024142866022884846,
          0.03693505749106407,
          0.012922762893140316,
          0,
          0.013004950247704983,
          0.011948864907026291,
          0.06622282415628433,
          0,
          0.0065535930916666985,
          0.006391000933945179,
          0.01834152266383171,
          0.018088284879922867,
          0.05414261296391487,
          0.05580001696944237,
          0.004833510145545006,
          0.0033102009911090136,
          0.034040264785289764,
          0.055475641041994095,
          0.000016852933185873553,
          0.047966353595256805,
          0,
          0.005368529818952084,
          0.004510171245783567,
          0.005928666330873966,
          0.0017446314450353384,
          0.02811116725206375,
          0.04553425684571266,
          0.02402607910335064,
          0.02610122412443161,
          0.01540742814540863,
          0.013052236288785934,
          0,
          0,
          0,
          0.025815468281507492,
          0.034785784780979156,
          0.022352537140250206,
          0.002235177904367447,
          0.0008137483382597566,
          0,
          0.029272714629769325,
          0.026053650304675102,
          0.05843110382556915,
          0.04021172970533371,
          0,
          0.003925535827875137,
          0.04997413232922554,
          0.01522665936499834,
          0.0031660159584134817,
          0.019487164914608,
          0.023419277742505074,
          0.0018382043344900012,
          0.0422351099550724,
          0.01757226139307022,
          0.013464268296957016,
          0.003943875897675753,
          0.053201861679553986,
          0.07802063226699829,
          0,
          0,
          0.010653771460056305,
          0.007378688082098961,
          0.0013548450078815222,
          0,
          0.02639395371079445,
          0.026414604857563972,
          0,
          0.08412102609872818,
          0.04475907236337662,
          0.01135162077844143,
          0.00003060758899664506,
          0.012367096729576588,
          0.04263588786125183,
          0,
          0,
          0,
          0.03957749530673027,
          0.01725752279162407,
          0.010723487474024296,
          0.030670128762722015,
          0.03526937961578369,
          0.02129540964961052,
          0.009480791166424751,
          0,
          0,
          0.021731719374656677,
          0.03615451976656914,
          0.0040421863086521626,
          0.03465735912322998,
          0.014355749823153019,
          0.02717847377061844,
          0.0007575673516839743,
          0.0007634258363395929,
          0.04806952551007271,
          0.0009926182683557272,
          0.022683193907141685,
          0,
          0.03599856421351433,
          0.006121277809143066,
          0.04840173199772835,
          0.018784107640385628,
          0,
          0,
          0.034596435725688934,
          0.0032313386909663677,
          0.03239967301487923,
          0.04619055613875389,
          0.020937180146574974,
          0.048300851136446,
          0.017734508961439133,
          0.014760375954210758,
          0.06308180838823318,
          0,
          0.02383866347372532,
          0.012574197724461555,
          0.002765258541330695,
          0.03503359109163284,
          0.06446658074855804,
          0,
          0,
          0,
          0.04384676367044449,
          0.0020879681687802076,
          0.016089564189314842,
          0,
          0.051403358578681946,
          0.057461075484752655,
          0,
          0.06384925544261932,
          0.012626146897673607,
          0.01725337654352188,
          0.011092586442828178,
          0.027392324060201645,
          0.026484467089176178,
          0.0017087355954572558,
          0.004979311488568783,
          0.03756159916520119,
          0.004423235077410936,
          0.03326457738876343,
          0.00012115574645576999,
          0.003090600250288844,
          0.07479316741228104,
          0.02532007358968258,
          0.022327588871121407,
          0.010070111602544785,
          0.020677227526903152,
          0.017798390239477158,
          0.003608955070376396,
          0.003385283052921295,
          0.006597108673304319,
          0,
          0.054058823734521866,
          0.0008840180234983563,
          0.10980815440416336,
          0.007017591968178749,
          0.006506499368697405,
          0,
          0.03486445173621178,
          0.021480612456798553,
          0.017732203006744385,
          0,
          0.05302828922867775,
          0,
          0.0021788408048450947,
          0.056696999818086624,
          0.04950179532170296,
          0.0035866207908838987,
          0.014942784793674946,
          0.007768247742205858,
          0,
          0.015402380377054214,
          0.042717110365629196,
          0,
          0.020733559504151344,
          0.03654814884066582,
          0.008162790909409523,
          0.006786883808672428,
          0.007389364764094353,
          0.01151036936789751,
          0,
          0.0339682437479496,
          0.015405419282615185,
          0.0006337081431411207,
          0.010159364901483059,
          0.04888388141989708,
          0,
          0.0030066431500017643,
          0.001081586116924882,
          0.011180014349520206,
          0.04857097193598747,
          0.04014647379517555,
          0.003792463568970561,
          0.00537470355629921,
          0.027147959917783737,
          0.015971297398209572,
          0.03159847483038902,
          0.00878580566495657,
          0.007491250056773424,
          0.002934505697339773,
          0.01476875226944685,
          0.07751962542533875,
          0.0447879433631897,
          0.013520794920623302,
          0.0039491127245128155,
          0.022997820749878883,
          0.003820873098447919,
          0.004501390736550093,
          0.03609983250498772,
          0.006568353623151779,
          0.05659325048327446,
          0,
          0,
          0.0034101582132279873,
          0.01653534546494484,
          0.008683187887072563,
          0.012353336438536644,
          0.00342526170425117,
          0.008493372239172459,
          0.027646111324429512,
          0.009422375820577145,
          0,
          0.044391367584466934,
          0.07664734870195389,
          0.024531621485948563,
          0.061798349022865295,
          0,
          0.024397652596235275,
          0.031217407435178757,
          0.038634009659290314,
          0.0009690542938187718,
          0.0017709288513287902,
          0.021854447200894356,
          0.0023937481455504894,
          0,
          0.004587732721120119,
          0,
          0.02573242224752903,
          0.013354763388633728,
          0.0629589781165123,
          0,
          0.009249265305697918,
          0.0005224275519140065,
          0.011211474426090717,
          0.003390796249732375,
          0,
          0.006445426028221846,
          0.06731004267930984,
          0.0409531369805336,
          0.0000668998109176755,
          0.046119604259729385,
          0,
          0.009682469069957733,
          0.03261604160070419,
          0.0004890289274044335,
          0.10116290301084518,
          0.010141557082533836,
          0.001045313198119402,
          0.0002659958554431796,
          0,
          0.05898825079202652,
          0.11224956065416336,
          0,
          0.04101504385471344,
          0.12422802299261093,
          0.029381465166807175,
          0.002636169083416462,
          0.08121582865715027,
          0.013876942917704582,
          0.000830275472253561,
          0.03304342180490494,
          0.0035826980601996183,
          0,
          0.004295011982321739,
          0.03496524319052696,
          0.021674375981092453,
          0.017881890758872032,
          0,
          0.036537326872348785,
          0.003197839017957449,
          0.012530614621937275,
          0,
          0.01204160787165165,
          0.0021171830594539642,
          0.0161155816167593,
          0,
          0,
          0.006584540940821171,
          0.0027084751054644585,
          0.05047379434108734,
          0.03838883712887764,
          0,
          0.014812313951551914,
          0,
          0.0004775526758749038,
          0.03977930545806885,
          0.007209107279777527,
          0.0319887138903141,
          0.03577476739883423,
          0.03896452859044075,
          0.006222811061888933,
          0.011184587143361568,
          0.009506038390100002,
          0.02640702575445175,
          0.04842017963528633,
          0.007135841064155102,
          0.015230458229780197,
          0.016664279624819756,
          0.02618805691599846,
          0.0010332176461815834,
          0.05604316666722298,
          0.007963059470057487,
          0.032309867441654205,
          0.0003197045880369842,
          0.01782509870827198,
          0.04290839657187462,
          0.006099631078541279,
          0.010947437956929207,
          0.040923453867435455,
          0.010707435198128223,
          0.0023156339302659035,
          0.029520053416490555,
          0.005192277021706104,
          0.056581154465675354,
          0.01459936797618866,
          0.0353817380964756,
          0.029431506991386414,
          0.0005109260673634708,
          0.020749375224113464,
          0.0026995381340384483,
          0,
          0,
          0.05763009563088417,
          0.0028380986768752337,
          0.0532124862074852,
          0.07380668073892593,
          0.0011819606879726052,
          0.028764205053448677,
          0.010783043690025806,
          0.0005734827136620879,
          0.0029599773697555065,
          0,
          0.007332134991884232,
          0.026504257693886757,
          0.004093915689736605,
          0.058145251125097275,
          0.08804092556238174,
          0.00027232617139816284,
          0.014916625805199146,
          0.09709546715021133,
          0.0055136969313025475,
          0.013376534916460514,
          0.07837331295013428,
          0.010627441108226776,
          0,
          0.00988780427724123,
          0.05218839645385742,
          0,
          0.001751777483150363,
          0,
          0,
          0.003508558264002204,
          0.013449547812342644,
          0.04631432518362999,
          0.05014696717262268,
          0.0037486678920686245,
          0,
          0.011770707555115223,
          0.022966336458921432,
          0.024571256712079048,
          0.005428539123386145,
          0.012592336162924767,
          0.010058020241558552,
          0.007330078165978193,
          0.015135504305362701,
          0.007835798896849155,
          0,
          0.01357996091246605,
          0,
          0.035310354083776474,
          0,
          0.024132035672664642,
          0.016733035445213318,
          0.010780371725559235,
          0.009916534647345543,
          0.0039598168805241585,
          0.08509121835231781,
          0.024541612714529037,
          0.001415971084497869,
          0,
          0.0006667572306469083,
          0.04671717807650566,
          0,
          0.016270391643047333,
          0.001237747143022716,
          0,
          0.007175293751060963,
          0.0026504029519855976,
          0.020934848114848137,
          0.02552104741334915,
          0.06929474323987961,
          0.0029949077870696783,
          0.048098646104335785,
          0.052454873919487,
          0,
          0.042125120759010315,
          0.00995715893805027,
          0.04061677306890488,
          0,
          0.032306309789419174,
          0.01313500851392746,
          0,
          0.03242591395974159,
          0,
          0,
          0,
          0.012102209962904453,
          0.0023549089673906565,
          0.01735161803662777,
          0.023809975013136864,
          0.0010014688596129417,
          0.0291597917675972,
          0.007579165045171976,
          0,
          0.04522685334086418,
          0.014748982153832912,
          0.016570543870329857,
          0,
          0.04373472183942795,
          0.022158753126859665,
          0,
          0.007800760213285685,
          0,
          0.016494104638695717,
          0.0006242733215913177,
          0.05435893312096596,
          0,
          0.05975643917918205,
          0.01014220342040062,
          0.01414074469357729,
          0.05875594541430473,
          0.006898293271660805,
          0.006855456158518791,
          0,
          0.04221271350979805,
          0.00015376866213046014,
          0.03264399617910385,
          0.027938969433307648,
          0.027534272521734238,
          0.00032191461650654674,
          0.0007908841944299638,
          0.0000988540705293417,
          0.00592840276658535,
          0.015693064779043198,
          0,
          0.05189957842230797,
          0.06173521652817726,
          0,
          0.004758545663207769,
          0.014745633117854595,
          0.0020179040729999542,
          0.008125156164169312,
          0.02356918714940548,
          0.08570931851863861,
          0.006437764037400484,
          0.032743677496910095,
          0.040352366864681244,
          0,
          0.020565520972013474,
          0.07147788256406784,
          0,
          0.01588653028011322,
          0.0018331415485590696,
          0.024962838739156723,
          0.01858680322766304,
          0.05884035304188728,
          0,
          0.04780302196741104,
          0.010863079689443111,
          0.028026005253195763,
          0.0066647883504629135,
          0,
          0,
          0.04936762526631355,
          0,
          0.012397760525345802,
          0.01245629321783781,
          0.0007302656886167824,
          0,
          0.0022744275629520416,
          0.012816292233765125,
          0,
          0.008007016032934189,
          0,
          0.08916135132312775,
          0,
          0.03162955120205879,
          0.008298981003463268,
          0.005095142405480146,
          0.001196149387396872,
          0,
          0.014695674180984497,
          0.0008230944513343275,
          0.014369373209774494,
          0.008720595389604568,
          0.07122012227773666,
          0.007321626879274845,
          0.05679481476545334,
          0.013687899336218834,
          0.07328756153583527,
          0.06621245294809341,
          0.0018980875611305237,
          0.013133813627064228,
          0.04851623997092247,
          0.01540352776646614,
          0.0064783040434122086,
          0.0011055368231609464,
          0.019036369398236275,
          0,
          0.001709197647869587,
          0.026489179581403732,
          0.0015617073513567448,
          0.02093617059290409,
          0.04055240750312805,
          0.056908976286649704,
          0,
          0,
          0.03043457120656967,
          0.0018967316718772054,
          0.007203506305813789,
          0.00889284536242485,
          0.0037724340800195932,
          0.004969761706888676,
          0.006744895596057177,
          0.005401295144110918,
          0.05746788531541824,
          0.00175790349021554,
          0.01870994083583355,
          0.013326686806976795,
          0.029063748195767403,
          0.005704811774194241,
          0.0699232667684555,
          0.0028944402001798153,
          0.0015561975305899978,
          0.01961221545934677,
          0.022695960476994514,
          0.03367222845554352,
          0.030592897906899452,
          0.0015430107014253736,
          0,
          0.036533478647470474,
          0,
          0,
          0.05105523392558098,
          0.027961594983935356,
          0.014643216505646706,
          0.060733772814273834,
          0.009196948260068893,
          0.0030673877336084843,
          0.0986165776848793,
          0.0012454434763640165,
          0.00466257194057107,
          0.03689934313297272,
          0.010762056335806847,
          0,
          0.005020755808800459,
          0.003461795626208186,
          0.004592068027704954,
          0.010680324397981167,
          0.0405762754380703,
          0.05576777830719948,
          0.0006881855078972876,
          0.007574192713946104,
          0.04698377475142479,
          0.010639690794050694,
          0.0027410828042775393,
          0.0013202460249885917,
          0.005930316634476185,
          0.023718494921922684,
          0.010931645520031452,
          0.014416086487472057,
          0.005059928633272648,
          0.02727147564291954,
          0.019349008798599243,
          0,
          0,
          0.01304702740162611,
          0.002077836776152253,
          0,
          0.04499804228544235,
          0.002157053677365184,
          0.012875516898930073,
          0.06990066915750504,
          0.03579786792397499,
          0.002965768799185753,
          0.0015888870693743229,
          0.0020582270808517933,
          0.001927636913023889,
          0.0027442756108939648,
          0.006262113805860281,
          0.038792964071035385,
          0.04008082300424576,
          0.007750344928354025,
          0,
          0.014787641353905201,
          0.006297719664871693,
          0.0015649631386622787,
          0.006715874653309584,
          0.007750834338366985,
          0.0015869771596044302,
          0.002423668745905161,
          0.011478114873170853,
          0,
          0.00813580583781004,
          0.017535386607050896,
          0.002453377703204751,
          0.036172062158584595,
          0.00007651197665836662,
          0.0021862483117729425,
          0.030762827023863792,
          0.0031183597166091204,
          0,
          0.018381884321570396,
          0.022805288434028625,
          0.017368780449032784,
          0.0005775116733275354,
          0,
          0.01706675998866558,
          0.0013509027194231749,
          0.007195106707513332,
          0.003361242124810815,
          0.00041740460437722504,
          0.001726349350064993,
          0.002879553707316518,
          0.0036964458413422108,
          0.11902466416358948,
          0.008242509327828884,
          0.0064353542402386665,
          0.026098378002643585,
          0.0437576062977314,
          0,
          0.058774687349796295,
          0.010403676889836788,
          0.000942337850574404,
          0.06251031905412674,
          0.0494895875453949,
          0.016844160854816437,
          0.0037595394533127546,
          0.01881714165210724,
          0,
          0,
          0.011324647814035416,
          0.005517461337149143,
          0.04230101779103279,
          0.02480172924697399,
          0,
          0.008726926520466805,
          0.00429916474968195,
          0.04668590426445007,
          0.04607439413666725,
          0.03723734989762306,
          0,
          0.00024296416086144745,
          0.020163824781775475,
          0.0018083881586790085,
          0.0005139787681400776,
          0,
          0.0008962129359133542,
          0,
          0.01010204292833805,
          0,
          0.004693091381341219,
          0.0007101763621903956,
          0.027886755764484406,
          0.029304467141628265,
          0.000577339087612927,
          0.02716783992946148,
          0.0062110088765621185,
          0,
          0.005130527541041374,
          0,
          0.004675481002777815,
          0.03615657985210419,
          0.01809854991734028,
          0.11477187275886536,
          0.06254106014966965,
          0.022249918431043625,
          0.004303391557186842,
          0.009660792537033558,
          0.002641377504914999,
          0.003967279102653265,
          0.03448483347892761,
          0.010285703465342522,
          0.03260311856865883,
          0.011874839663505554,
          0.0014666530769318342,
          0.006401077378541231,
          0.02404179982841015,
          0.07054666429758072,
          0.030477432534098625,
          0.013455845415592194,
          0,
          0.0016226444859057665,
          0.0002169454237446189,
          0.025703079998493195,
          0.0009630179847590625,
          0.04195273667573929,
          0.011883857659995556,
          0.04757755249738693,
          0.03247465193271637,
          0.023792164400219917,
          0.00002314045741513837,
          0.0059694284573197365,
          0.0006178346811793745,
          0.05325464531779289,
          0.0005890553584322333,
          0.014313895255327225,
          0,
          0.00018535798881202936,
          0.007096778601408005,
          0.025290539488196373,
          0,
          0.007006899453699589,
          0.01919047348201275,
          0,
          0.0313284769654274,
          0.0011933211935684085,
          0.006160231772810221,
          0.06192060932517052,
          0.0027024494484066963,
          0.0008191344095394015,
          0.019963812083005905,
          0.0020619735587388277,
          0.003976926207542419,
          0.0487702302634716,
          0.05400104075670242,
          0.0019487321842461824,
          0.0017504486022517085,
          0,
          0.016397476196289062,
          0.06448280066251755,
          0.04593019559979439,
          0.030343858525156975,
          0.006237681023776531,
          0,
          0.01965852826833725,
          0.05730057507753372,
          0,
          0.04008832201361656,
          0.00032619736157357693,
          0.006257274188101292,
          0.006360229570418596,
          0.011782505549490452,
          0,
          0.024915792047977448,
          0.08393065631389618,
          0.004968499764800072,
          0,
          0.030601704493165016,
          0.0009195852326229215,
          0,
          0.019156912341713905,
          0,
          0.0022923508659005165,
          0.007118352688848972,
          0,
          0.036852434277534485,
          0.04185260832309723,
          0.03026481531560421,
          0.01195148192346096,
          0.06032427400350571,
          0,
          0.031002227216959,
          0.012126493267714977,
          0.004969348199665546,
          0.021866876631975174,
          0.041957102715969086,
          0.016551921144127846,
          0.015133879147469997,
          0.0241968035697937,
          0,
          0.001709269592538476,
          0.0508890263736248,
          0.00028290675254538655,
          0.028374258428812027,
          0.0034929593093693256,
          0.00396244041621685,
          0.00048515727394260466,
          0.005092333070933819,
          0.004203077871352434,
          0,
          0.04114065691828728,
          0.0015371107729151845,
          0.004885710775852203,
          0.007500241044908762,
          0.03232515975832939,
          0.03552044928073883,
          0.03236759454011917,
          0.01530227530747652,
          0.011250215582549572,
          0.0023105586878955364,
          0.012497983872890472,
          0.019421467557549477,
          0.01409259345382452,
          0.01970543898642063,
          0.01067314948886633,
          0,
          0.002584948902949691,
          0.05547976866364479,
          0.010560553520917892,
          0.00619804160669446,
          0.0654292032122612,
          0.0034025891218334436,
          0.03516572341322899,
          0.08888756483793259,
          0.009812125004827976,
          0.0001386378426104784,
          0.0038693526294082403,
          0.008504889905452728,
          0.0018915312830358744,
          0,
          0.029138902202248573,
          0.0011802512453868985,
          0,
          0.06813348829746246,
          0.0004478263726923615,
          0.012098215520381927,
          0.020000586286187172,
          0.0022777977865189314,
          0.00067477225093171,
          0.002783719915896654,
          0.040298569947481155,
          0.03415415436029434,
          0.005543829407542944,
          0.019715702161192894,
          0.004676755052059889,
          0.0045829275622963905,
          0,
          0.0055016083642840385,
          0.006126771215349436,
          0.006780550349503756,
          0.00007284738239832222,
          0.02761787921190262,
          0.09608039259910583,
          0.00034056432195939124,
          0.017490949481725693,
          0.021464085206389427,
          0.12084414064884186,
          0,
          0.012018317356705666,
          0.0030554153490811586,
          0.009596405550837517,
          0.013695633970201015,
          0.06772314757108688,
          0.03188481554389,
          0.019285650923848152,
          0.006616235710680485,
          0.02833430841565132,
          0.057347189635038376,
          0.07302230596542358,
          0.011973666027188301,
          0.012896718457341194,
          0.002870573429390788,
          0.05525379627943039,
          0,
          0.02001577988266945,
          0.015038480050861835,
          0.0017092082416638732,
          0.001171657582744956,
          0.020844265818595886,
          0,
          0.009937786497175694,
          0.0037466806825250387,
          0.03742234408855438,
          0.005852837115526199,
          0.023468444123864174,
          0,
          0.0484548844397068,
          0,
          0.04836288467049599,
          0.0011990085477009416,
          0.01288998406380415,
          0.0004884946974925697,
          0.002154937945306301,
          0.003515091026201844,
          0.00048701491323299706,
          0,
          0.0025003987830132246,
          0.013934117741882801,
          0.00626600394025445,
          0.0009066894417628646,
          0.03965974226593971,
          0.0013971123844385147,
          0,
          0.056996818631887436,
          0.009585188701748848,
          0.06140320003032684,
          0.0023878372740000486,
          0.08238568902015686,
          0.017313489690423012,
          0,
          0.08041403442621231,
          0,
          0.007742760237306356,
          0,
          0.002392278052866459,
          0.0001511170412413776,
