{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "conv2d_1",
            "trainable": true,
            "batch_input_shape": [
              null,
              224,
              224,
              3
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last",
            "name": "max_pooling2d_1",
            "trainable": true
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 3,
            "activation": "softmax",
            "use_bias": true,
            "name": "classification",
            "trainable": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "model.weights.bin"
      ],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "classification/kernel",
          "shape": [
            25088,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "classification/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "format": "tfjs_layers_model",
  "generatedBy": "TensorFlow.js v4.2.0",
  "convertedBy": null,
  "signature": null,
  "userDefinedMetadata": {
    "metadata": {
      "modelName": "my-image-model",
      "timeStamp": "2025-11-12T05:56:55.334Z",
      "labels": [
        "sakis",
        "no_sakis",
        "nothing"
      ],
      "userMetadata": {},
      "modelSettings": {
        "inputImageHeight": 224,
        "inputImageWidth": 224,
        "inputImageChannels": 3
      }
    },
    "examples": {
      "sakis": {
        "inferences": [
          0.01928279548883438,
          0,
          0.027219586074352264,
          0.0015450642677024007,
          0.00797273125499487,
          0.0048264069482684135,
          0,
          0,
          0,
          0.014426112174987793,
          0.00144711893517524,
          0.007850781083106995,
          0.004175981506705284,
          0,
          0.000008433061339019332,
          0.007405775599181652,
          0,
          0,
          0,
          0.02479133941233158,
          0.02280777506530285,
          0.00005568831693381071,
          0,
          0,
          0.01106931921094656,
          0.034901127219200134,
          0,
          0.00565490173175931,
          0.08324207365512848,
          0,
          0,
          0.013333138078451157,
          0,
          0.11746417731046677,
          0.005508400034159422,
          0.012742644175887108,
          0,
          0.0003583627112675458,
          0.001165156252682209,
          0.006277537439018488,
          0.0052163489162921906,
          0.015735885128378868,
          0.02585301734507084,
          0.013145126402378082,
          0.0018776572542265058,
          0.0033174988348037004,
          0.08948378264904022,
          0.04820116236805916,
          0.01067139208316803,
          0,
          0.00260738842189312,
          0.01835356093943119,
          0.0006641020881943405,
          0.01574113219976425,
          0.0012311441823840141,
          0.05280200392007828,
          0.0010544282849878073,
          0.001194226904772222,
          0.06636696308851242,
          0,
          0,
          0.0004235823289491236,
          0.03661715239286423,
          0.0847938284277916,
          0,
          0,
          0,
          0,
          0.01069459319114685,
          0.01255016028881073,
          0.0708819106221199,
          0.07098528742790222,
          0,
          0.006390539929270744,
          0.032796502113342285,
          0.009110093116760254,
          0.03539053723216057,
          0.04490860179066658,
          0,
          0.010903098620474339,
          0.007338571362197399,
          0.014197082258760929,
          0.015620490536093712,
          0,
          0.00531975319609046,
          0.019524849951267242,
          0.004790168721228838,
          0.05021020397543907,
          0,
          0.008070196025073528,
          0.00019399580196477473,
          0.00555012933909893,
          0,
          0.002541583962738514,
          0,
          0,
          0.007882513105869293,
          0,
          0.0014864068944007158,
          0.02875170111656189,
          0.029921146109700203,
          0.035489555448293686,
          0.032279640436172485,
          0.02650316245853901,
          0.03568529710173607,
          0,
          0,
          0.008946564048528671,
          0.002295138780027628,
          0.013869103975594044,
          0.010775591246783733,
          0.00013027922250330448,
          0,
          0,
          0.03643020987510681,
          0.028244296088814735,
          0.0003308994637336582,
          0.015384521335363388,
          0,
          0,
          0,
          0.02184760570526123,
          0.006031087599694729,
          0.022295482456684113,
          0,
          0.06513191759586334,
          0.021799512207508087,
          0.031099840998649597,
          0.0009539074962958694,
          0.018812302500009537,
          0.00154300092253834,
          0.012421295046806335,
          0.0022212036419659853,
          0.007659073453396559,
          0.0020257611759006977,
          0.0009616800234653056,
          0,
          0.058905843645334244,
          0.04181107506155968,
          0.08877236396074295,
          0,
          0.005299631971865892,
          0.01003326941281557,
          0.01308016199618578,
          0.012805277481675148,
          0.0014241678873077035,
          0.0030358387157320976,
          0.0006422277656383812,
          0.03692656755447388,
          0.0008861165842972696,
          0.07637092471122742,
          0.04595503956079483,
          0.00035654360544867814,
          0,
          0.018787730485200882,
          0.0037987432442605495,
          0.025751587003469467,
          0.015148931182920933,
          0.019147878512740135,
          0,
          0.01776306703686714,
          0.001146252267062664,
          0.006244969088584185,
          0.005156752187758684,
          0.0353279635310173,
          0.0033622905611991882,
          0,
          0.011821272782981396,
          0.004026937764137983,
          0.038089800626039505,
          0.05194978043437004,
          0,
          0.028148243203759193,
          0.0003401096910238266,
          0.031161285936832428,
          0,
          0.000007414573246933287,
          0.02115011028945446,
          0.020099202170968056,
          0.011910517700016499,
          0.0006340693798847497,
          0.05187929421663284,
          0,
          0.03299085050821304,
          0.012738481163978577,
          0.06459014862775803,
          0.02904359996318817,
          0.0022820732556283474,
          0,
          0.018308794125914574,
          0.001997655024752021,
          0,
          0.031849395483732224,
          0.014658194035291672,
          0.00246398220770061,
          0.04509887471795082,
          0.033598460257053375,
          0.0213121697306633,
          0.0005251170950941741,
          0.005792172625660896,
          0,
          0.005900423973798752,
          0,
          0,
          0.0005985494353808463,
          0.005009983666241169,
          8.11101415365556e-7,
          0,
          0.020993784070014954,
          0.00246420013718307,
          0.07567530125379562,
          0,
          0,
          0.0380447655916214,
          0.0047000739723443985,
          0,
          0.008890172466635704,
          0.007166646886616945,
          0,
          0.013376670889556408,
          0,
          0.00764950318261981,
          0,
          0.007565630134195089,
          0.00789839681237936,
          0.05386657267808914,
          0,
          0.073985755443573,
          0.03752027824521065,
          0.047609031200408936,
          0.04449986666440964,
          0.04922689124941826,
          0.0010240640258416533,
          0.004796149674803019,
          0.00040754626388661563,
          0.004462290555238724,
          0.007837430573999882,
          0.061200689524412155,
          0.0022231435868889093,
          0.026444673538208008,
          0.002318618120625615,
          0.1215720921754837,
          0.0009823120199143887,
          0.0019773400854319334,
          0.04093239828944206,
          0.0002874110359698534,
          0.0016434320714324713,
          0,
          0.008317278698086739,
          0.03330620750784874,
          0,
          0.02959270216524601,
          0,
          0,
          0.03510289266705513,
          0,
          0.001966626849025488,
          0.0013237448874861002,
          0,
          0.027586158365011215,
          0.05438307300209999,
          0,
          0.01080381404608488,
          0.005097367335110903,
          0.0011952448403462768,
          0.006712107453495264,
          0.02080562710762024,
          0.003380891401320696,
          0.0033375974744558334,
          0.0221383199095726,
          0.04562288522720337,
          0.0011137394467368722,
          0,
          0.0056461007334291935,
          0,
          0.017306411638855934,
          0.02025020681321621,
          0.0037890018429607153,
          0.029298296198248863,
          0.000049226422561332583,
          0.03571818768978119,
          0.00390629144385457,
          0.012920120730996132,
          0.03486659750342369,
          0.018312722444534302,
          0,
          0.03298686444759369,
          0,
          0.013643608428537846,
          0.0059713502414524555,
          0.04059404879808426,
          0.013274728320538998,
          0.01438662875443697,
          0.003079907735809684,
          0.0015615365700796247,
          0.005494324956089258,
          0,
          0.010497809387743473,
          0,
          0.004846744704991579,
          0.004899302963167429,
          0,
          0.0716778039932251,
          0.001926023280248046,
          0,
          0,
          0,
          0.003180415602400899,
          0.017042307183146477,
          0.02537725307047367,
          0,
          0.016938108950853348,
          0.0012651639990508556,
          0.01598716713488102,
          0.043994322419166565,
          0.02087840810418129,
          0.0006179565098136663,
          0.028290141373872757,
          0.009164494462311268,
          0.02967706322669983,
          0.003206071211025119,
          0,
          0,
          0.024573858827352524,
          0,
          0.008318348787724972,
          0.0005914663779549301,
          0,
          0.018845874816179276,
          0.0011113161453977227,
          0.060226939618587494,
          0.003546249819919467,
          0.0006136806914582849,
          0.03756047785282135,
          0,
          0,
          0.006261114031076431,
          0.016658026725053787,
          0.0921468436717987,
          0.004401201847940683,
          0.0003196302568539977,
          0.07389984279870987,
          0.025905678048729897,
          0.0147128039970994,
          0,
          0.0275786854326725,
          0.01119909342378378,
          0,
          0.008868297562003136,
          0.003893077140673995,
          0.016464540734887123,
          0.038407545536756516,
          0.013298936188220978,
          0.0485677607357502,
          0.000024207411115639843,
          0,
          0,
          0,
          0.01953626610338688,
          0,
          0,
          0,
          0.0013796265702694654,
          0.07749523967504501,
          0,
          0,
          0,
          0.0006529336096718907,
          0.018006106838583946,
          0.0060999514535069466,
          0,
          0,
          0.02172829397022724,
          0,
          0.011162579990923405,
          0.02241002768278122,
          0.01056252233684063,
          0.004110758192837238,
          0.013883291743695736,
          0.05948707088828087,
          0,
          0.00649140402674675,
          0.0010259938426315784,
          0,
          0.005271990783512592,
          0.0001619166723685339,
          0,
          0.0075384206138551235,
          0.025575418025255203,
          0.022340497002005577,
          0.015354502946138382,
          0,
          0,
          0.01891309581696987,
          0.03619998320937157,
          0.010563565418124199,
          0.0004946208209730685,
          0.011449228040874004,
          0.004292416851967573,
          0.0004301424487493932,
          0.008719218894839287,
          0.0016442076303064823,
          0.00787939690053463,
          0.013948674313724041,
          0.08708740770816803,
          0.020088765770196915,
          0.03967832028865814,
          0.003730660304427147,
          0.03775111958384514,
          0,
          0.0004106022242922336,
          0.014443294145166874,
          0,
          0.0045244270004332066,
          0,
          0.0021244329400360584,
          0.09881400316953659,
          0,
          0,
          0.016161305829882622,
          0.06592531502246857,
          0,
          0.0003009689680766314,
          0.0241767056286335,
          0.004765314515680075,
          0.024784740060567856,
          0.0014563631266355515,
          0.09016385674476624,
          0.019559932872653008,
          0.040750954300165176,
          0.007074752822518349,
          0,
          0.06111406162381172,
          0.0035921840462833643,
          0.0009419967536814511,
          0.001658414606936276,
          0.02034805528819561,
          0.08560983091592789,
          0,
          0.00616562319919467,
          0.00011666998034343123,
          0.00424245884642005,
          0,
          0,
          0,
          0.008707666769623756,
          0,
          0,
          0.0003344878205098212,
          0.0003122575581073761,
          0,
          0,
          0.02346876449882984,
          0.0020706658251583576,
          0,
          0.0011949377367272973,
          0,
          0.014225204475224018,
          0.0010254794033244252,
          0.010748669505119324,
          0.005335133522748947,
          0.003906048135831952,
          0.006202001590281725,
          0.0038302401080727577,
          0.007495320867747068,
          0.0062132468447089195,
          0.030751390382647514,
          0.0007344011683017015,
          0.015030068345367908,
          0,
          0,
          0.04184138402342796,
          0.0021469329949468374,
          0.14316383004188538,
          0.03404005244374275,
          0.14059457182884216,
          0,
          0.04177125543355942,
          0,
          0.018998168408870697,
          0,
          0.09218001365661621,
          0.0005722522037103772,
          0.04848693311214447,
          0,
          0.02862308919429779,
          0.07270541787147522,
          0,
          0,
          0.008055870421230793,
          0.007864649407565594,
          0.007698926609009504,
          0.008783608675003052,
          0.0037669187877327204,
          0,
          0.007281314115971327,
          0,
          0,
          0.021319853141903877,
          0.004177733790129423,
          0.06368373334407806,
          0,
          0.0010055607417598367,
          0.04299916699528694,
          0.022123005241155624,
          0,
          0,
          0.025450492277741432,
          0.024294136092066765,
          0.024327654391527176,
          0.0028559849597513676,
          0.001088535413146019,
          0,
          0.09264270216226578,
          0.0002597015118226409,
          0,
          0.023796536028385162,
          0.025069179013371468,
          0.009930727072060108,
          0,
          0,
          0.008068363182246685,
          0.005639140959829092,
          0.05446210876107216,
          0,
          0.11178544163703918,
          0.0008126049069687724,
          0.011525691486895084,
          0.0004621253756340593,
          0.011312037706375122,
          0,
          0,
          0.002908196998760104,
          0.0036651347763836384,
          0,
          0.003507688408717513,
          0.0008277979795821011,
          0.008487826213240623,
          0.12484990805387497,
          0.0466168187558651,
          0,
          0.015620371326804161,
          0.0020594580564647913,
          0,
          0.026602070778608322,
          0.000028527634640340693,
          0.010688806883990765,
          0,
          0,
          0,
          0,
          0,
          0.05972124636173248,
          0.019993888214230537,
          0.009240826591849327,
          0,
          0.03151778131723404,
          0.029401937499642372,
          0.004432900808751583,
          0.031954020261764526,
          0.040593650192022324,
          0.004511178005486727,
          0,
          0.00009725588461151347,
          0.01151182409375906,
          0.00675654923543334,
          0.0048464760184288025,
          0.04609443247318268,
          0,
          0.018848195672035217,
          0.005941222421824932,
          0.02337941899895668,
          0.0006204043165780604,
          0.015734292566776276,
          0.024670103564858437,
          0.061453305184841156,
          0,
          0,
          0.008807755075395107,
          0.022365272045135498,
          0.0580839142203331,
          0.02925993874669075,
          0,
          0.0004648443136829883,
          0.08467680960893631,
          0,
          0,
          0,
          0.03130674734711647,
          0.00816767755895853,
          0,
          0.020646827295422554,
          0.0036356847267597914,
          0.009173440746963024,
          0.007242018356919289,
          0.04165438562631607,
          0,
          0.05031277611851692,
          0,
          0.023431330919265747,
          0.04611082375049591,
          0.000961428799200803,
          0.018349386751651764,
          0,
          0.0013297366676852107,
          0.06698919087648392,
          0,
          0,
          0.0010584344854578376,
          0,
          0.11044275760650635,
          0.034746985882520676,
          0.005802123341709375,
          0.0023025053087621927,
          0.01462956890463829,
          0.047709595412015915,
          0.025079872459173203,
          0.04636518657207489,
          0.012330183759331703,
          0.002507495228201151,
          0.024001620709896088,
          0,
          0,
          0.10037199407815933,
          0,
          0.002436828799545765,
          0.005198243539780378,
          0.000012889383469882887,
          0.010014282539486885,
          0.07216789573431015,
          0,
          0.0113495122641325,
          0.01877916045486927,
          0,
          0.028491802513599396,
          0.02133668214082718,
          0.023536793887615204,
          0.03922886401414871,
          0.03495267406105995,
          0,
          0.00199239794164896,
          0.007562141865491867,
          0.005033974070101976,
          0,
          0.0036800983361899853,
          0.004474420566111803,
          0.045995403081178665,
          0.01764550618827343,
          0.03512442857027054,
          0.005735373590141535,
          0.016305629163980484,
          0,
          0.04424191638827324,
          0.07106266170740128,
          0.009867019020020962,
          0.000057602654123911634,
          0.03053314983844757,
          0,
          0,
          0.0009275245829485357,
          0.008222135715186596,
          0,
          0.018793337047100067,
          0.005109836347401142,
          0.0037638405337929726,
          0.017758434638381004,
          0.003156691323965788,
          0.0010889318073168397,
          0,
          0.0478244312107563,
          0.00012889332720078528,
          0.0026114163920283318,
          0.005236395169049501,
          0.04478102922439575,
          0.01143771130591631,
          0.005288553424179554,
          0.0001783066982170567,
          0.022414661943912506,
          0,
          0.01033260952681303,
          0.0022851780522614717,
          0,
          0.0014210321241989732,
          0,
          0.003029016312211752,
          0,
          0.020435841754078865,
          0.010905078612267971,
          0.020789263769984245,
          0.01862809620797634,
          0.006911382544785738,
          0.02160349301993847,
          0.03459307178854942,
          0.005955164786428213,
          0.031687378883361816,
          0.045336246490478516,
          0,
          0.023413224145770073,
          0.022803952917456627,
          0.020816262811422348,
          0.02126554399728775,
          0.00021134597773198038,
          0.03600625693798065,
          0.014961757697165012,
          0.009785065427422523,
          0.00218772841617465,
          0.009481958113610744,
          0.047663941979408264,
          0,
          0.00023453692847397178,
          0,
          0.003888291073963046,
          0,
          0,
          0,
          0.005506071262061596,
          0,
          0.04803449660539627,
          0.0016094051534309983,
          0,
          0,
          0,
          0.019176961854100227,
          0.01610100083053112,
          0.00792913418263197,
          0.06435862183570862,
          0,
          0.021169167011976242,
          0.049345120787620544,
          0.0684446394443512,
          0,
          0.01681528612971306,
          0.0020407838746905327,
          0.010506176389753819,
          0.002314381767064333,
          0,
          0,
          0,
          0.0994390919804573,
          0.00369671150110662,
          0.0005568507476709783,
          0,
          0,
          0.03167380020022392,
          0,
          0.00002538243825256359,
          0,
          0,
          0.004818487446755171,
          0.027132436633110046,
          0.007504967041313648,
          0.004426144994795322,
          0.011735153384506702,
          0,
          0,
          0.06928368657827377,
          0,
          0,
          0,
          0.00023421936202794313,
          0,
          0.010418226011097431,
          0.009321250021457672,
          0,
          0.003396242391318083,
          0.014546881429851055,
          0,
          0.007666670251637697,
          0,
          0.020758455619215965,
          0,
          0,
          0.0016453501302748919,
          0.0747348889708519,
          0,
          0,
          0.009103933349251747,
          0,
          0.0021685794927179813,
          0,
          0.002418520860373974,
          0,
          0,
          0.037399403750896454,
          0.007883907295763493,
          0.005116970743983984,
          0.008794799447059631,
          0,
          0.001623495016247034,
          0,
          0.0010228920727968216,
          0.0013564859982579947,
          0.02314179204404354,
          0.045727647840976715,
          0,
          0.009957036934792995,
          0.0075824204832315445,
          0.09186496585607529,
          0.016264138743281364,
          0,
          0,
          0.05410915985703468,
          0.0032031494192779064,
          0,
          0.07400642335414886,
          0.019864831119775772,
          0.05559759587049484,
          0.02999178133904934,
          0.06116235628724098,
          0.05315326154232025,
          0.027418335899710655,
          0.012008801102638245,
          0.01186690665781498,
          0.000315619632601738,
          0.0004248466284479946,
          0.014399640262126923,
          0.00011506422742968425,
          0.0005969481426291168,
          0,
          0.03710797801613808,
          0.04527954384684563,
          0.03717552870512009,
          0,
          0,
          0.09407760202884674,
          0.012521881610155106,
          0.03696613386273384,
          0.03013618104159832,
          0.0663396567106247,
          0.0038666848558932543,
          0.005252900533378124,
          0.026419484987854958,
          0.02230740152299404,
          0.0052718715742230415,
          0,
          0.022289955988526344,
          0.0032130409963428974,
          0,
          0.001174550037831068,
          0.03366420418024063,
          0.012730664573609829,
          0.02430538646876812,
          0.044965483248233795,
          0.005592723842710257,
          0.026994502171874046,
          0.0462324284017086,
          0,
          0,
          0.0001636545202927664,
          0.010660755448043346,
          0.0025922430213540792,
          0,
          0,
          0.019855599850416183,
          0.01215299405157566,
          0.024735063314437866,
          0.14139524102210999,
          0.0006380900158546865,
          0.017280133441090584,
          0.005315873771905899,
          0.006372465286403894,
          0.01917097344994545,
          0.0032527372241020203,
          0.030570296570658684,
          0.008436189964413643,
          0.010101530700922012,
          0,
          0.06064516678452492,
          0.006020167842507362,
          0,
          0,
          0.00981202069669962,
          0.05424143373966217,
          0.014138644561171532,
          0,
          0.022602006793022156,
          0.0009381257696077228,
          0.006958488840609789,
          0.09682876616716385,
          0.00569582125172019,
          0,
          0.007999450899660587,
          0.025496629998087883,
          0,
          0.010277905501425266,
          0,
          4.097881571851758e-7,
          0.015026130713522434,
          0.001225613639689982,
          0.042201463133096695,
          0.01810726337134838,
          0.0006030077347531915,
          0.0011278257006779313,
          0.0029964467976242304,
          0,
          0.003791356459259987,
          0.014323587529361248,
          0.024190504103899002,
          0.1878116875886917,
          0.0532442070543766,
          0.014774509705603123,
          0.0004585559363476932,
          0.026980016380548477,
          0.01364596001803875,
          0,
          0.004461104050278664,
          0.013122431002557278,
          0.04286045953631401,
          0,
          0,
          0,
          0.03705231472849846,
          0,
          0.0018429255578666925,
          0.00008147455810103565,
          0,
          0,
          0.024166956543922424,
          0.08367332816123962,
          0.03748588263988495,
          0.0004329820803832263,
          0.003916995134204626,
          0.002573940670117736,
          0.0026928535662591457,
          0.04151178523898125,
          0,
          0.018558764830231667,
          0.000035243276215624064,
          0,
          0.0001828627282520756,
          0.0025463628116995096,
          0,
          0.00692280288785696,
          0,
          0.007473637815564871,
          0.03336622193455696,
          0.039337802678346634,
          0,
          0.0022563852835446596,
          0.011279701255261898,
          0.0500183030962944,
          0.001992665696889162,
          0.04836525022983551,
          0.023861097171902657,
          0.010983183979988098,
          0.05341696739196777,
          0,
          0.10173104703426361,
          0,
          0.008237226866185665,
          0.01911977119743824,
          0,
          0.0513731949031353,
          0,
          0.043029461055994034,
          0,
          0.00032631299109198153,
          0.06480921059846878,
          0.05171051621437073,
          0,
          0.0027041661087423563,
          0.015274010598659515,
          0.0020847085397690535,
          0.059464383870363235,
          0.01203149650245905,
          0.007929257117211819,
          0,
          0.022799547761678696,
          0,
          0,
          0,
          0.02329169027507305,
          0.017699183896183968,
          0.021018577739596367,
          0.00643450953066349,
          0,
          0,
          0.00356458337046206,
          0.006896294187754393,
          0.023044411092996597,
          0.0013241955311968923,
          0.004642972256988287,
          0.01631852239370346,
          0,
          0.008091597817838192,
          0,
          0.010955658741295338,
          0.028593121096491814,
          0,
          0.0019241546979174018,
          0,
          0,
          0.00290547963231802,
          0.0378355048596859,
          0.01858457736670971,
          0.07002696394920349,
          0.0465121828019619,
          0.006948705762624741,
          0.015039293095469475,
          0.03932327777147293,
          0.0009680612129159272,
          0.06160353869199753,
          0.00802822969853878,
          0,
          0.00013776110426988453,
          0.04553248733282089,
          0.007565776817500591,
          0.1345146745443344,
          0,
          0.0527883917093277,
          0.02360914647579193,
          0.06463097780942917,
          0.041811153292655945,
          0.0000948878878261894,
          0.007081708870828152,
          0.023722171783447266,
          0,
          0.03549554571509361,
          0.009816561825573444,
          0,
          0.022806499153375626,
          0.02790836989879608,
          0.0142150167375803,
          0.01862606219947338,
          0.000030627426895080134,
          0.06390364468097687,
          0,
          0.005590339656919241,
          0,
          0.013905112631618977,
          0,
          0.053446199744939804,
          0.011528128758072853,
          0.029598284512758255,
          0.017960894852876663,
          0.0021733299363404512,
          0.0001854490692494437,
          0,
          0,
          0.018182236701250076,
          0,
          0.004630780778825283,
          0.007049813866615295,
          0,
          0.026191234588623047,
          0.014464532025158405,
          0.023903045803308487,
          0,
          0.019999178126454353,
          0.008365750312805176,
          0,
          0.001423716195859015,
          0.013068398460745811,
          0.012248496524989605,
          0.005263783503323793,
          0.01560070738196373,
          0,
          0,
          0.00022456838632933795,
          0,
          0.05794056877493858,
          0.005628503393381834,
          0.01648056134581566,
          0.0004960205988027155,
          0.05580592900514603,
          0.03690180554986,
          0.00046489370288327336,
          0.0168644767254591,
          0.008260619826614857,
          0.004772818647325039,
          0.0048062303103506565,
          0.06335422396659851,
          0,
          0.003335163462907076,
          0.01457990799099207,
          0.0046165576204657555,
          0.02920408546924591,
          0,
          0.000359537749318406,
          0.0014191551599651575,
          0.00759161077439785,
          0,
          0.004095572046935558,
          0.025395575910806656,
          0.04236774891614914,
          0,
          0,
          0,
          0,
          0.0049280161038041115,
          0.009075191803276539,
          0.0023581846617162228,
          0.00010183135600527748,
          0.0030311800073832273,
          0.014384660869836807,
          0,
          0.0055717057548463345,
          0.00488077150657773,
          0.020494017750024796,
          0.07159760594367981,
          0.012332052923738956,
          0,
          0.08344904333353043,
          0.030027762055397034,
          0.07479976862668991,
          0,
          0.06511767208576202,
          0.02613440901041031,
          0.003502398496493697,
          0.01064944639801979,
          0,
          0,
          0.00017077448137570173,
          0.049110766500234604,
          0.0037894765846431255,
          0.01732456497848034,
          0.028084052726626396,
          0.00036953468224965036,
          0.06273921579122543,
          0.002110386034473777,
          0.03900330886244774,
          0.053393181413412094,
          0.09106529504060745,
          0.001630759914405644,
          0,
          0.004668535199016333,
          0.0014771271962672472,
          0.003360817674547434,
          0,
          0.0001374290877720341,
          0,
          0,
          0.012187163345515728,
          0,
          0.043396957218647,
          0,
          0.003439763095229864,
          0.029694829136133194,
          0.006839405745267868,
          0.019633309915661812,
          0.004591938573867083,
          0.010315530933439732,
          0,
          0,
          0,
          0.008523770608007908,
          0,
          0.0343128927052021,
          0,
          0,
          0.0006045571644790471,
          0.0004336685233283788,
          0.008060883730649948,
          0.06384538859128952,
          0,
          0.003336886642500758,
          0,
          0.03925536572933197,
          0,
          0.0007271765498444438,
          0.04208184778690338,
          0,
          0.02163422480225563,
          0.0001681512367213145,
          0,
          0.06391715258359909,
          0.06440164893865585,
          0.0012352620251476765,
          0.02165837027132511,
          0.012519598938524723,
          0,
          0.0065374672412872314,
          0.04082454741001129,
          0.041169315576553345,
          0.010604497976601124,
          0.01866072788834572,
          0.00002689047687454149,
          0.0022445800714194775,
          0,
          0.00382379163056612,
          0.07334218174219131,
          0.003016773611307144,
          0,
          0.0018659050110727549,
          0,
          0.0418563187122345,
          0.004446225240826607,
          0.004149727988988161,
          0,
          0.020765550434589386,
          0.0012944040354341269,
          0,
          0,
          0.002270991448312998,
          0,
          0.00047437066677957773,
          0,
          0,
          0.0062769511714577675,
          0,
          0.000023298100131796673,
          0.02993767149746418,
          0.016338706016540527,
          0.0052373469807207584,
          0.0003741754626389593,
          0.0014361090725287795,
          0.11528325080871582,
          0.03278406336903572,
          0.00805838592350483,
          0,
          0.0378817543387413,
          0.020231563597917557,
          0,
          0,
          0.08679685741662979,
          0.039656005799770355,
          0,
          0,
          0,
          0.01842913217842579,
          0.03945588320493698,
          0.000880132254678756,
          0.013439390808343887,
          0,
          0.000494843116030097,
          0,
          0.05051437020301819,
          0,
          0.08143287897109985,
          0.0018419524421915412,
          0.03070257231593132,
          0,
          0.016442883759737015,
          0.06556578725576401,
          0.04851826652884483,
          0.004223499447107315,
          0.02540433406829834,
          0.009127733297646046,
          0.08005081862211227,
          0,
          0.018194083124399185,
          0.00034580635838210583,
          0.06737322360277176,
          0.07640736550092697,
          0.006787301506847143,
          0.0004975177580490708,
          0,
          0.0012847735779359937,
          0,
          0.0020657237619161606,
          0.008371683768928051,
          0.021158572286367416,
          0.008200561627745628,
          0.013890966773033142,
          0.008701716549694538,
          0.007049265783280134,
          0.013864931650459766,
          0,
          0.02493925951421261,
          0.049830541014671326,
          0.005273434799164534,
          0,
          0,
          0,
          0.000823990732897073,
          0.02826756052672863,
          0.05269015580415726,
          0.0022792944218963385,
          0.0004525118274614215,
          0.008431488648056984,
          0.03440134972333908,
          0,
          0.010022764094173908,
          0.002312476048246026,
          0.044893525540828705,
          0.019758114591240883,
          0,
          0,
          0.028809210285544395,
          0.0019577564671635628,
          0.01207014825195074,
          0,
          0.023169202730059624,
          0.0006866678595542908,
          0.00019915496523026377,
          0.0031244398560374975,
          0,
          0.00015193175931926817,
          0,
          0.015480210073292255,
          0.000649274792522192,
          0.00034711509943008423,
          0.0013131349114701152,
          0,
          0.0006643033702857792,
          0.005379520356655121,
          0,
          0,
          0,
          0.010414570569992065,
          0.03216215968132019,
          0.0005567861371673644,
          0,
          0.002330856630578637,
          0.0263853520154953,
          0.02787458710372448,
          0,
          0.011056417599320412,
          0.09068620204925537,
          0,
          0,
          0.024339783936738968,
          0,
          0.12188658118247986,
          0.009794866666197777,
          0.015814321115612984,
          0.0001273762172786519,
          0.001356577849946916,
          0.0025268676690757275,
          0.02225690707564354,
          0.003193145152181387,
          0.014289269223809242,
          0.02419511042535305,
          0.008628454990684986,
          0.008057675324380398,
          0.004466522019356489,
          0.0641004666686058,
          0.05625532940030098,
          0.021976469084620476,
          0,
          0.005142023786902428,
          0.022029869258403778,
          0,
          0.015819987282156944,
          0.00027706415858119726,
          0.05389900878071785,
          0.0007006321684457362,
          0.001774434233084321,
          0.06548841297626495,
          0,
          0.000574908044654876,
          0,
          0.040795210748910904,
          0.05828278511762619,
          0,
          0,
          0.0001170080722658895,
          0,
          0.013699142262339592,
          0.005982226226478815,
          0.06876716017723083,
          0.08693435043096542,
          0,
          0.002743843710049987,
          0.03474922105669975,
          0.0057154190726578236,
          0.05249497666954994,
          0.04315701499581337,
          0,
          0.02655327506363392,
          0.007851281203329563,
          0.021560825407505035,
          0.013812296092510223,
          0,
          0.0024401696864515543,
          0.023579971864819527,
          0.004191468469798565,
          0.04949723184108734,
          0.0024297949858009815,
          0.00752943055704236,
          0,
          0.010547640733420849,
          0,
          0.011654406785964966,
          0,
          0,
          0.004126749467104673,
          0,
          0.0006852940423414111,
          0.03964447230100632,
          0.024159252643585205,
          0.050444550812244415,
          0.021480536088347435,
          0.01748279295861721,
          0.029442764818668365,
          0.0008408791036345065,
          0,
          0.0062759327702224255,
          0.004061322659254074,
          0.006819557398557663,
          0.012685742229223251,
          0.0012611878337338567,
          0,
          0,
          0.02403266169130802,
          0.04245077073574066,
          0.0015115272253751755,
          0.020979203283786774,
          0,
          0.004069290589541197,
          0.0003229613648727536,
          0.021386900916695595,
          0.003960986156016588,
          0.023251816630363464,
          0,
          0.0685330182313919,
          0.03264432027935982,
          0.02945975959300995,
          0.0019115316681563854,
          0.02168748527765274,
          0.0031342250294983387,
          0.004287203773856163,
          0.0030623876955360174,
          0.014138448983430862,
          0.0029739816673099995,
          0.0017523246351629496,
          0,
          0.06977161765098572,
          0.02979746274650097,
          0.09416933357715607,
          0,
          0.003597747068852186,
          0.01165966410189867,
          0.0037718364037573338,
          0.010780065320432186,
          0.002901155035942793,
          0.001474779681302607,
          0.0028224296402186155,
          0.0527045913040638,
          0,
          0.059839099645614624,
          0.048993077129125595,
          0.0026668948121368885,
          0.00047940469812601805,
          0.021444307640194893,
          0.0052384911105036736,
          0.02699374221265316,
          0.016500918194651604,
          0.022775208577513695,
          0,
          0.01772679015994072,
          0.00030395531211979687,
          0.018131425604224205,
          0.0033586735371500254,
          0.044635023921728134,
          0.004815229214727879,
          0,
          0.016130011528730392,
          0.0032084386330097914,
          0.04694913327693939,
          0.028804948553442955,
          0,
          0.012016608379781246,
          0.0017728450475260615,
          0.022965142503380775,
          0,
          0.0004376231227070093,
          0.023572100326418877,
          0.020947055891156197,
          0.01034917589277029,
          0.005196162033826113,
          0.065862737596035,
          0,
          0.031307563185691833,
          0.012689142487943172,
          0.05572684481739998,
          0.033224742859601974,
          0.0053519317880272865,
          0,
          0.018512658774852753,
          0,
          0,
          0.028967225924134254,
          0.015550704672932625,
          0.002277261344715953,
          0.05939570069313049,
          0.04970300942659378,
          0.017795788124203682,
          0.000025548082703608088,
          0.008182787336409092,
          0,
          0.006728236097842455,
          0,
          0.003353932173922658,
          0,
          0.009619167074561119,
          0,
          0,
          0.020351381972432137,
          0,
          0.04935960844159126,
          0,
          0,
          0.034904781728982925,
          0.01685170643031597,
          0.0001794302515918389,
          0.003514001378789544,
          0.007133461534976959,
          0.011294392868876457,
          0.007765645161271095,
          0.002074160147458315,
          0.01356713566929102,
          0.003429628675803542,
          0.0019964438397437334,
          0.007013840600848198,
          0.06040514260530472,
          0,
          0.0773254930973053,
          0.039166465401649475,
          0.03876199945807457,
          0.050384774804115295,
          0.024219080805778503,
          0.004127101507037878,
          0.0012988527305424213,
          0.00044315599370747805,
          0.0015126247890293598,
          0.018201535567641258,
          0.07604529708623886,
          0.000711969390977174,
          0.01005334872752428,
          0.00648074084892869,
          0.09978104382753372,
          0.0009249235736206174,
          0.002142414916306734,
          0.035519473254680634,
          0,
          0.003288098843768239,
          0,
          0.010290980339050293,
          0.05032310262322426,
          0,
          0.034161753952503204,
          0,
          0,
          0.02128060720860958,
          0,
          0.00004400831676321104,
          0.012163245119154453,
          0,
          0.03256217762827873,
          0.06472812592983246,
          0,
          0.014394858852028847,
          0.0006278189248405397,
          0,
          0.01593366451561451,
          0.024793384596705437,
          0.0015037812991067767,
          0.005441369954496622,
          0.01820739358663559,
          0.041838839650154114,
          0.0021643436048179865,
          0,
          0.00028014378040097654,
          0.0018567637307569385,
          0.0045038084499537945,
          0.03467446565628052,
          0.008261051960289478,
          0.04251682013273239,
          0.0014706727815791965,
          0.018340984359383583,
          0.0085518853738904,
          0.014631102792918682,
          0.04993802309036255,
          0.020850392058491707,
          0.001124194241128862,
          0.03313437104225159,
          0,
          0.0037747540045529604,
          0.010901562869548798,
          0.03193433955311775,
          0.0013935104943811893,
          0.0013046790845692158,
          0.0031008811201900244,
          0,
          0.00816386379301548,
          0,
          0.016171863302588463,
          0,
          0.0035529618617147207,
          0.01629750244319439,
          0.0029344563372433186,
          0.09768496453762054,
          0.003330463543534279,
          0,
          0,
          0,
          0.00406904611736536,
          0.016033252701163292,
          0.013693997636437416,
          0,
          0.010905924253165722,
          0.003058380912989378,
          0.028962135314941406,
          0.06644328683614731,
          0.02523295022547245,
          0.004098857752978802,
          0.03228336572647095,
          0.018742335960268974,
          0.036076534539461136,
          0.0012871024664491415,
          0,
          0,
          0.019387399777770042,
          0,
          0.0006388783222064376,
          0.002415170893073082,
          0,
          0.03365228325128555,
          0.0020187634509056807,
          0.057291723787784576,
          0.007896153256297112,
          0.0025280695408582687,
          0.05319023132324219,
          0,
          0,
          0.021528709679841995,
          0.019534045830368996,
          0.08696504682302475,
          0.0031920750625431538,
          0.0017755585722625256,
          0.08231319487094879,
          0.030874302610754967,
          0.03992289677262306,
          0,
          0.03753523901104927,
          0.008068871684372425,
          0.0004579942033160478,
          0.0037157731130719185,
          0.0033908647019416094,
          0.008664099499583244,
          0.0364435650408268,
          0.015659846365451813,
          0.055850107222795486,
          0.0015966303180903196,
          0,
          0,
          0,
          0.010321519337594509,
          0.004382505547255278,
          0.0004502843366935849,
          0,
          0.0000403408776037395,
          0.06927842646837234,
          0,
          0,
          0,
          0.0017248193034902215,
          0.017913272604346275,
          0.005016628187149763,
          0.0012482276652008295,
          0,
          0.041050802916288376,
          0,
          0.022811399772763252,
          0.026751568540930748,
          0.007913255132734776,
          0.007070682942867279,
          0.014533990062773228,
          0.03526866436004639,
          0,
          0,
          0.0038464986719191074,
          0.0013442134950309992,
          0.014388754963874817,
          0,
          0.00013525252870749682,
          0.006037267856299877,
          0.021720027551054955,
          0.032817207276821136,
          0.015109850093722343,
          0,
          0,
          0.022049635648727417,
          0.03977132588624954,
          0.012628372758626938,
          0,
          0.013567175716161728,
          0.005758928135037422,
          0.0011732629500329494,
          0.0012840746203437448,
          0.0030207238160073757,
          0.008510172367095947,
          0.006099777761846781,
          0.1167924627661705,
          0.020818419754505157,
          0.03364602476358414,
          0.01074390672147274,
          0.05989682301878929,
          0,
          0,
          0.025900335982441902,
          0,
          0.004929375369101763,
          0,
          0.0018344750860705972,
          0.09234612435102463,
          0.0013501173816621304,
          0,
          0.020465310662984848,
          0.07069786638021469,
          0,
          0,
          0.030666420236229897,
          0.003628502134233713,
          0.01816006377339363,
          0.007081601303070784,
          0.09001433104276657,
          0.02366669848561287,
          0.02912263758480549,
          0.01906691864132881,
          0,
          0.03150331601500511,
