{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "conv2d_1",
            "trainable": true,
            "batch_input_shape": [
              null,
              224,
              224,
              3
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last",
            "name": "max_pooling2d_1",
            "trainable": true
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 3,
            "activation": "softmax",
            "use_bias": true,
            "name": "classification",
            "trainable": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "model.weights.bin"
      ],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "classification/kernel",
          "shape": [
            25088,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "classification/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "format": "tfjs_layers_model",
  "generatedBy": "TensorFlow.js v4.2.0",
  "convertedBy": null,
  "signature": null,
  "userDefinedMetadata": {
    "metadata": {
      "modelName": "my-image-model",
      "timeStamp": "2025-11-12T16:29:40.676Z",
      "labels": [
        "sakis",
        "no_sakis",
        "nothing"
      ],
      "userMetadata": {},
      "modelSettings": {
        "inputImageHeight": 224,
        "inputImageWidth": 224,
        "inputImageChannels": 3
      }
    },
    "examples": {
      "sakis": {
        "inferences": [
          0.014654088765382767,
          0.001739348517730832,
          0.014852485619485378,
          0.018481023609638214,
          0.008486662060022354,
          0.014217257499694824,
          0.006733489688485861,
          0.01746446266770363,
          0.007995100691914558,
          0.011409666389226913,
          0,
          0.0069920942187309265,
          0.027710111811757088,
          0.008867191150784492,
          0.010214283131062984,
          0.04696572571992874,
          0,
          0.0021900262217968702,
          0.0002198787551606074,
          0.004963359329849482,
          0,
          0.003972792066633701,
          0.0038927351124584675,
          0.002764264354482293,
          0.05222654715180397,
          0.0268220454454422,
          0.024529723450541496,
          0.02137952670454979,
          0.02666187286376953,
          0.0070291198790073395,
          0.014615960419178009,
          0,
          0.030254270881414413,
          0.058664944022893906,
          0.048635438084602356,
          0.00556268822401762,
          0.0032372567802667618,
          0.0036870636977255344,
          0.007519928272813559,
          0.00195634295232594,
          0.03131719306111336,
          0.005294536706060171,
          0.036131784319877625,
          0.021110279485583305,
          0.040919527411460876,
          0.026201361790299416,
          0,
          0.030981076881289482,
          0.0031679333187639713,
          0,
          0.0013637903612107038,
          0.011646991595625877,
          0.0019065981032326818,
          0.00206642784178257,
          0,
          0.0010281186550855637,
          0.024777963757514954,
          0.011145928874611855,
          0.01880401186645031,
          0.0003302791155874729,
          0.000005339666586223757,
          0.008759541437029839,
          0.0005744878435507417,
          0.007185617461800575,
          0.008161312900483608,
          0.07578669488430023,
          0.008699863217771053,
          0.0023426299449056387,
          0.0050516375340521336,
          0,
          0.0002094275114359334,
          0.024589233100414276,
          0.028376776725053787,
          0.04040882736444473,
          0.023063112050294876,
          0.00029106365400366485,
          0.02211311087012291,
          0.04178334027528763,
          0.06701444089412689,
          0.006742688361555338,
          0.02206476964056492,
          0.00007091866427799687,
          0.005919220391660929,
          0.02222033031284809,
          0.004791128449141979,
          0.055122606456279755,
          0,
          0.013692600652575493,
          0.001970158889889717,
          0.004140336066484451,
          0.0066126747988164425,
          0.010090055875480175,
          0.03097335435450077,
          0.0022915333975106478,
          0.026111247017979622,
          0.00004318006176617928,
          0.003972136881202459,
          0.0011482189875096083,
          0.01575639098882675,
          0.0017111661145463586,
          0.10512810200452805,
          0,
          0.06486222892999649,
          0.004657313227653503,
          0.007429247256368399,
          0.0014586756005883217,
          0.007881567813456059,
          0.06596547365188599,
          0,
          0.004039279650896788,
          0,
          0,
          0.04124121740460396,
          0.024878470227122307,
          0.002032751217484474,
          0.000018596170775708742,
          0.0031016110442578793,
          0.044701624661684036,
          0.052215151488780975,
          0,
          0.007642651442438364,
          0,
          0.04863875359296799,
          0.0731818899512291,
          0.03448231890797615,
          0,
          0.0004417675081640482,
          0.009493041783571243,
          0.05832855403423309,
          0.03141487389802933,
          0.019428545609116554,
          0.007054972928017378,
          0.036837514489889145,
          0.012636619620025158,
          0.0059502022340893745,
          0.0029169658664613962,
          0.005396687425673008,
          0.019389713183045387,
          0.000634611991699785,
          0.03300946205854416,
          0.0007017521420493722,
          0.10491276532411575,
          0.03086370788514614,
          0.02061721682548523,
          0.042118724435567856,
          0.00639542518183589,
          0,
          0.0004330234951339662,
          0.10223069787025452,
          0.05862264335155487,
          0.008227321319282055,
          0.00009529834642307833,
          0.06688691675662994,
          0.027469854801893234,
          0.028675172477960587,
          0.011620655655860901,
          0.01559898629784584,
          0.044811543077230453,
          0.02260746620595455,
          0,
          0.011705239303410053,
          0.026049779728055,
          0.00047303803148679435,
          0.018534556031227112,
          0.030885152518749237,
          0,
          0.018038488924503326,
          0.0019513258012011647,
          0.006246879231184721,
          0.015285738743841648,
          0.00466485321521759,
          0.0250408835709095,
          0.021275850012898445,
          0,
          0.021638836711645126,
          0.028600824996829033,
          0.026010511443018913,
          0.0026297704316675663,
          0.000113888738269452,
          0.00571992015466094,
          0,
          0.054940953850746155,
          0.018245365470647812,
          0,
          0,
          0.005098456051200628,
          0.0016578915528953075,
          0.015902236104011536,
          0.016344917938113213,
          0.011403366923332214,
          0.013749657198786736,
          0.02249927446246147,
          0.009775254875421524,
          0.0012975404970347881,
          0.012073921971023083,
          0.007287885993719101,
          0.00871259719133377,
          0.009723851457238197,
          0.03340074047446251,
          0.03282197564840317,
          0.0018786259461194277,
          0.022533206269145012,
          0.01757107861340046,
          0.006256751716136932,
          0.012887576594948769,
          0.020824380218982697,
          0.00800148956477642,
          0.0008844570838846266,
          0.03409891948103905,
          0,
          0,
          0,
          0.02575918845832348,
          0.025474965572357178,
          0.0035200396087020636,
          0.0020130188204348087,
          0.030968351289629936,
          0.048518259078264236,
          0.06970597803592682,
          0.013160550966858864,
          0.019543765112757683,
          0.0002641476457938552,
          0.0663074478507042,
          0.000704543141182512,
          0.008442038670182228,
          0.0063377320766448975,
          0.0013372214743867517,
          0.021901825442910194,
          0.08748306334018707,
          0.029602814465761185,
          0.00793259497731924,
          0.036968786269426346,
          0.01336119044572115,
          0.05230983346700668,
          0,
          0.0012891737278550863,
          0.006331210024654865,
          0.03539106249809265,
          0,
          0.007468112278729677,
          0.0016890260158106685,
          0.003922843839973211,
          0.0023890295997262,
          0.02356969751417637,
          0,
          0.07728668302297592,
          0,
          0,
          0,
          0.025583164766430855,
          0.004233396612107754,
          0.003995353821665049,
          0.00008856664499035105,
          0.08638957887887955,
          0.025055358186364174,
          0.0627993643283844,
          0.027484772726893425,
          0.06370283663272858,
          0.057982273399829865,
          0.003596085822209716,
          0.00096251314971596,
          0.043056782335042953,
          0.006770877633243799,
          0.012296963483095169,
          0.0013831881806254387,
          0.04878982529044151,
          0.005974894855171442,
          0.004939856939017773,
          0.03764732927083969,
          0,
          0,
          0.025734378024935722,
          0.0004260178538970649,
          0,
          0.00012089900701539591,
          0.00014195946278050542,
          0.0010689034825190902,
          0.014260763302445412,
          0.0511946901679039,
          0.007528332527726889,
          0.003929119557142258,
          0.021269844844937325,
          0.001718400977551937,
          0.02537548542022705,
          0.03326105326414108,
          0.04540989547967911,
          0.022398563101887703,
          0.0404898039996624,
          0.0020990234334021807,
          0.020605087280273438,
          0,
          0.015939226374030113,
          0.000855772930663079,
          0.0003000168944709003,
          0.003408663207665086,
          0,
          0.00006097445293562487,
          0.05519982799887657,
          0.006636246107518673,
          0.0072404006496071815,
          0,
          0.0003581267374102026,
          0.026774629950523376,
          0.002311400603502989,
          0.02762456424534321,
          0.00008105936285573989,
          0,
          0,
          0.027144988998770714,
          0.054189495742321014,
          0.003886141814291477,
          0.005003917962312698,
          0.00442103436216712,
          0,
          0,
          0.09224125742912292,
          0.05365336313843727,
          0,
          0.035495199263095856,
          0.004799426067620516,
          0.03206689655780792,
          0.02679555118083954,
          0.0021717343479394913,
          0.08560563623905182,
          0,
          0.012280835770070553,
          0.02102639339864254,
          0.03452647104859352,
          0.046243663877248764,
          0.02209843136370182,
          0.009256305173039436,
          0.009074341505765915,
          0.07128947973251343,
          0.007415144704282284,
          0.009638328105211258,
          0.0014129708288237453,
          0.027448566630482674,
          0.012264970690011978,
          0,
          0.014238343574106693,
          0.019476065412163734,
          0.008160121738910675,
          0.013689238578081131,
          0.004371041432023048,
          0.004669702611863613,
          0.000004525174063019222,
          0.04844449833035469,
          0.007662244141101837,
          0.05515110865235329,
          0.04527624696493149,
          0.002214142819866538,
          0.015159760601818562,
          0.01586947590112686,
          0.07432600855827332,
          0.0027099810540676117,
          0.010329368524253368,
          0.0007273686351254582,
          0.0784573033452034,
          0.045710984617471695,
          0.009717399254441261,
          0.04478665813803673,
          0.010562608949840069,
          0.06394968181848526,
          0.013011593371629715,
          0.028062976896762848,
          0.00587310828268528,
          0.00007617779920110479,
          0.0012101840693503618,
          0,
          0.007051736582070589,
          0.00383059517480433,
          0.02598913386464119,
          0.022964663803577423,
          0,
          0.004418740514665842,
          0.036205023527145386,
          0,
          0.013420967385172844,
          0.040439944714307785,
          0.003404534887522459,
          0.018673203885555267,
          0.04618578404188156,
          0.0002652580151334405,
          0.008260631002485752,
          0.00034614402102306485,
          0.02032262645661831,
          0.0030329586006700993,
          0.0013242755085229874,
          0,
          0.0021160633768886328,
          0.05824923887848854,
          0.0002856053179129958,
          0.002560644643381238,
          0.002145745325833559,
          0.04988902062177658,
          0.00820033811032772,
          0.003743337467312813,
          0.009111456573009491,
          0.007863749749958515,
          0.000666542851831764,
          0.017267484217882156,
          0.0025264122523367405,
          0.08794087171554565,
          0.00647301971912384,
          0,
          0.03921297565102577,
          0.05643976852297783,
          0.0018777952063828707,
          0.0003083348274230957,
          0.07768937200307846,
          0.0019856595899909735,
          0.02229849062860012,
          0.0009559621685184538,
          0.0026010603178292513,
          0.0015111055690795183,
          0.004137388430535793,
          0.0044007995165884495,
          0.029803302139043808,
          0,
          0.02304183691740036,
          0.0015055220574140549,
          0.0009632875444367528,
          0.05740007385611534,
          0,
          0.001998616149649024,
          0.006987311877310276,
          0.03216937929391861,
          0,
          0.009566918946802616,
          0.0034375013783574104,
          0.0002738968760240823,
          0.01934172958135605,
          0.05558107793331146,
          0.06210344284772873,
          0.004464572761207819,
          0.006270698271691799,
          0.0019574668258428574,
          0.004474101588129997,
          0.01176163088530302,
          0,
          0,
          0.02864101529121399,
          0.053883038461208344,
          0.027804307639598846,
          0,
          0.028449805453419685,
          0.016013920307159424,
          0.0042311204597353935,
          0.0003963809576816857,
          0.02069394662976265,
          0.035660263150930405,
          0.016003966331481934,
          0.014949404634535313,
          0.018664687871932983,
          0,
          0.011277468875050545,
          0.022814832627773285,
          0.012770377099514008,
          0.011139175854623318,
          0.0007251917268149555,
          0.051533833146095276,
          0.005090145394206047,
          0.0015216793399304152,
          0.021888967603445053,
          0.029501860961318016,
          0.03403143584728241,
          0,
          0.01560121588408947,
          0.003822599072009325,
          0.027025699615478516,
          0.07566200196743011,
          0,
          0.016422538086771965,
          0,
          0,
          0,
          0.02880578488111496,
          0.02193952351808548,
          0.0012911809608340263,
          0.001240361831150949,
          0.07367745041847229,
          0.03921879455447197,
          0.056184813380241394,
          0.009290603920817375,
          0.021179065108299255,
          0.0013410338433459401,
          0,
          0.0002192788670072332,
          0.003994462080299854,
          0,
          0.03848961740732193,
          0.0534539669752121,
          0,
          0.0005446598515845835,
          0.00024639637558721006,
          0.018598029389977455,
          0.05404353886842728,
          0,
          0.04800192639231682,
          0.010879909619688988,
          0.013234392739832401,
          0.000927840534131974,
          0.004115899093449116,
          0.024489913135766983,
          0.011021563783288002,
          0.040156640112400055,
          0.02240704745054245,
          0.021811125800013542,
          0.011704377830028534,
          0.01338630449026823,
          0,
          0.003597076516598463,
          0.04906052350997925,
          0.0005397632485255599,
          0.0014672392280772328,
          0.03523080423474312,
          0.014755327254533768,
          0.00006139479955891147,
          0.01951870694756508,
          0.0009748191223479807,
          0,
          0.006536625325679779,
          0,
          0.006227295380085707,
          0.013218898326158524,
          0.021974211558699608,
          0.05803792178630829,
          0.009156910702586174,
          0.03349326178431511,
          0,
          0.09696358442306519,
          0.008358991704881191,
          0.015057499520480633,
          0.011939028277993202,
          0.0442085787653923,
          0.03658217191696167,
          0.006411935202777386,
          0.002724249614402652,
          0.012199700810015202,
          0.0005733366124331951,
          0.01209171675145626,
          0,
          0.13940788805484772,
          0.038407016545534134,
          0.004153513815253973,
          0.05332300439476967,
          0.0021336989011615515,
          0,
          0,
          0.022054145112633705,
          0.0013425163924694061,
          0.010942966677248478,
          0.059992849826812744,
          0.00042111624497920275,
          0.005644951481372118,
          0.02545449510216713,
          0.005742304492741823,
          0,
          0,
          0.021328268572688103,
          0.010072299279272556,
          0.02215598337352276,
          0,
          0.020449349656701088,
          0,
          0.035028256475925446,
          0.06376846134662628,
          0.0012184397783130407,
          0.027242135256528854,
          0,
          0.0073588090017437935,
          0,
          0.013946250081062317,
          0.04181529954075813,
          0.006362445652484894,
          0,
          0.005633483175188303,
          0.05577108636498451,
          0.027888771146535873,
          0.023857636377215385,
          0,
          0.057298894971609116,
          0.07550042122602463,
          0.020998822525143623,
          0.010867657139897346,
          0.05007883161306381,
          0.09910135716199875,
          0.0010084907989948988,
          0.004744288511574268,
          0.045919619500637054,
          0.05324224382638931,
          0.0067561594769358635,
          0.022512102499604225,
          0.012592081911861897,
          0.019907686859369278,
          0.02299424447119236,
          0.010517175309360027,
          0.0030323772225528955,
          0.005177186336368322,
          0.02568661794066429,
          0.020674224942922592,
          0,
          0.05128680542111397,
          0.00044315954437479377,
          0.017898550257086754,
          0.019219644367694855,
          0.05089234188199043,
          0.008140393532812595,
          0.015547718852758408,
          0.0016013532876968384,
          0.002760105300694704,
          0.011392908170819283,
          0.03173203766345978,
          0.044268880039453506,
          0.011773495934903622,
          0,
          0,
          0.0017869804287329316,
          0,
          0.021398818120360374,
          0,
          0.026897085830569267,
          0.004177537746727467,
          0.02020983211696148,
          0.0006083320477046072,
          0,
          0.03349585086107254,
          0.007284157443791628,
          0.0011732579441741109,
          0.01786392740905285,
          0.012225735932588577,
          0.0038810463156551123,
          0.026010524481534958,
          0.020411688834428787,
          0,
          0.0062163034453988075,
          0,
          0.0005040816031396389,
          0.00928545743227005,
          0.007586567662656307,
          0,
          0.027885835617780685,
          0.07362153381109238,
          0.0407826229929924,
          0.02731296978890896,
          0.005843436345458031,
          0.01880757324397564,
          0.05197921022772789,
          0.006839877460151911,
          0.0004701021534856409,
          0.019708039239048958,
          0.05972980707883835,
          0.013529865071177483,
          0.021571069955825806,
          0.006096710450947285,
          0,
          0.0030256223399192095,
          0.06697337329387665,
          0.0007402875926345587,
          0.08476712554693222,
          0.00157689000479877,
          0.0027299344073981047,
          0.026737911626696587,
          0.0011718266177922487,
          0.0002588071802165359,
          0.004767174832522869,
          0.02795853652060032,
          0.009098625741899014,
          0.07072514295578003,
          0.00031522411154583097,
          0,
          0.01660328172147274,
          0.052053891122341156,
          0.02161761000752449,
          0.04968292638659477,
          0,
          0.014520538039505482,
          0.005624738987535238,
          0.013437914662063122,
          0.0030790355522185564,
          0.030579809099435806,
          0.04222671687602997,
          0.00024926598416641355,
          0,
          0.004220858681946993,
          0.030903007835149765,
          0.017347656190395355,
          0.0061591146513819695,
          0.016374407336115837,
          0.000540016801096499,
          0.017922572791576385,
          0.003104456001892686,
          0,
          0.012585275806486607,
          0.01134614646434784,
          0.007298653479665518,
          0,
          0.003334078472107649,
          0.0009104657219722867,
          0,
          0.04672303423285484,
          0.020970914512872696,
          0,
          0.00018773673218674958,
          0.0008811054867692292,
          0.006082507316023111,
          0,
          0.013649513013660908,
          0.0010197190567851067,
          0.011612167581915855,
          0.010793725028634071,
          0.0019530823919922113,
          0.016304587945342064,
          0.016399076208472252,
          0,
          0.03217479959130287,
          0.0011604259489104152,
          0.04018617421388626,
          0,
          0.023660933598876,
          0.012622402049601078,
          0.03546403348445892,
          0.03674312308430672,
          0.013204853050410748,
          0.0011609290959313512,
          0.0009686599369160831,
          0.05761447176337242,
          0.02857019193470478,
          0.04398724436759949,
          0,
          0.08693622797727585,
          0,
          0,
          0.02259591594338417,
          0.002607142785564065,
          0.000714295485522598,
          0,
          0.006697690114378929,
          0.01397394947707653,
          0.06547518819570541,
          0.005031477194279432,
          0.0058345128782093525,
          0.0030025984160602093,
          0.03956034779548645,
          0.05323875695466995,
          0.0063781351782381535,
          0.023076865822076797,
          0.07849719375371933,
          0.0000836438630358316,
          0.03295782953500748,
          0.01178120356053114,
          0.07965801656246185,
          0,
          0.025357190519571304,
          0.024551354348659515,
          0.05036536231637001,
          0.0652342364192009,
          0.04085352644324303,
          0.023027129471302032,
          0.001012918772175908,
          0.04905816912651062,
          0.015256727114319801,
          0.02626514993607998,
          0.023518025875091553,
          0.01836683228611946,
          0.01430597249418497,
          0,
          0,
          0.00926032941788435,
          0.042614974081516266,
          0.022431505843997,
          0.012881983071565628,
          0.0013484450755640864,
          0.002067439490929246,
          0.07671629637479782,
          0,
          0.03439941257238388,
          0.019414298236370087,
          0.0647130236029625,
          0.0011448173318058252,
          0.0007201818516477942,
          0.01367515791207552,
          0.048810768872499466,
          0.0009093484259210527,
          0.0538310632109642,
          0.04544698819518089,
          0.031449951231479645,
          0.0046538980677723885,
          0.04942803457379341,
          0,
          0.06427504122257233,
          0.010620271787047386,
          0.0074473535642027855,
          0,
          0.06430133432149887,
          0,
          0.0017175902612507343,
          0.0023380916099995375,
          0.05164318531751633,
          0.0018148821545764804,
          0.004425473511219025,
          0,
          0.009911391884088516,
          0,
          0,
          0.0033535477705299854,
          0.013908944092690945,
          0.07270900905132294,
          0.00485093891620636,
          0.028187774121761322,
          0.008401535451412201,
          0.00020035634224768728,
          0.040680695325136185,
          0.005334205459803343,
          0,
          0.0055618989281356335,
          0.002847404684871435,
          0.00195085268933326,
          0.004661419428884983,
          0.03560367971658707,
          0.008729797787964344,
          0.01301482506096363,
          0.023471618071198463,
          0,
          0.001997755141928792,
          0.00021498640126083046,
          0.09537296742200851,
          0.02138196863234043,
          0.016146093606948853,
          0.0746615082025528,
          0,
          0.07054485380649567,
          0,
          0.014338222332298756,
          0.06497688591480255,
          0.0075298212468624115,
          0.033194974064826965,
          0.007337701041251421,
          0.012343804351985455,
          0.00003653812746051699,
          0.010886694304645061,
          0.03596958890557289,
          0.04960455000400543,
          0.0010648953029885888,
          0,
          0.024558890610933304,
          0.00026971654733642936,
          0.0028374784160405397,
          0,
          0,
          0.017348740249872208,
          0.003432851517572999,
          0.012951603159308434,
          0.02502250298857689,
          0.000184467964572832,
          0.03820670023560524,
          0,
          0.030559126287698746,
          0.0018259265925735235,
          0.01460458617657423,
          0.033821672201156616,
          0.010331383906304836,
          0.00913562998175621,
          0.019037723541259766,
          0.045112244784832,
          0,
          0,
          0.0004789991653524339,
          0.029876234009861946,
          0.02920929715037346,
          0.003459933679550886,
          0.0036252879071980715,
          0.006505922880023718,
          0.006269986741244793,
          0.00026768879615701735,
          0.00031786333420313895,
          0,
          0.002400399185717106,
          0.002331042429432273,
          0,
          0.03695707395672798,
          0.019002754241228104,
          0.0018235845491290092,
          0.005427040625363588,
          0,
          0.022850625216960907,
          0.0835653692483902,
          0.014404868707060814,
          0,
          0.0014669171068817377,
          0.07318490743637085,
          0.02459113486111164,
          0.003277780022472143,
          0,
          0.027247650548815727,
          0,
          0.02988862805068493,
          0.015812523663043976,
          0.00502037676051259,
          0.04875587299466133,
          0.021543443202972412,
          0,
          0.005432977341115475,
          0.006082035135477781,
          0.010381663218140602,
          0.039063915610313416,
          0.1353330910205841,
          0.003004159778356552,
          0.05108955502510071,
          0.00171323970425874,
          0,
          0.08217652887105942,
          0.0021466203033924103,
          0.014551263302564621,
          0.021419629454612732,
          0.00010977427882608026,
          0.013729725033044815,
          0.0006182570359669626,
          0.007824458181858063,
          0.0012282681418582797,
          0.03485764190554619,
          0.006681991275399923,
          0.028347287327051163,
          0,
          0.025929542258381844,
          0.07040554285049438,
          0.04787706211209297,
          0.01073318812996149,
          0.0004247922624927014,
          0.005885135382413864,
          0.023200329393148422,
          0.00014851817104499787,
          0.00032833690056577325,
          0.011437089182436466,
          0.0031019605230540037,
          0.0003364197909832001,
          0.006954685784876347,
          0.017529351636767387,
          0.025656884536147118,
          0.0027346357237547636,
          0.0006953984266147017,
          0.007117022294551134,
          0.04211585968732834,
          0.006511158309876919,
          0.009595906361937523,
          0.00031584364478476346,
          0,
          0.0028663217090070248,
          0.0009340213146060705,
          0.012494019232690334,
          0,
          0.00015149025421123952,
          0.012950414791703224,
          0.006579143926501274,
          0.06818046420812607,
          0.014483518898487091,
          0.024727674201130867,
          0.0013440231559798121,
          0.001715063233859837,
          0.012198666110634804,
          0.015181045979261398,
          0.03310364484786987,
          0.018508151173591614,
          0.0245647132396698,
          0.0006096686120145023,
          0.008343460038304329,
          0.0037757004611194134,
          0.023057671263813972,
          0.05978045612573624,
          0,
          0.03447544947266579,
          0.00011229288793401793,
          0,
          0,
          0.015320131555199623,
          0,
          0.03287805989384651,
          0.03962638974189758,
          0.03254816681146622,
          0.0006802220013923943,
          0.003914076369255781,
          0.01931086927652359,
          0.02298862673342228,
          0.0006909313960932195,
          0.001800161087885499,
          0.05316641554236412,
          0.02205813303589821,
          0.004179344978183508,
          0.02773250639438629,
          0.009653177112340927,
          0.0006002568989060819,
          0.011640118435025215,
          0.04942640662193298,
          0.0014011707389727235,
          0.030863607302308083,
          0.0005878888186998665,
          0,
          0.02502293884754181,
          0.0024605058133602142,
          0,
          0.05103428661823273,
          0.04871999844908714,
          0.034181516617536545,
          0.060579814016819,
          0.03383602946996689,
          0.025298992171883583,
          0,
          0.002534339437261224,
          0.01672113686800003,
          0.02837284281849861,
          0.006055518984794617,
          0.004054582677781582,
          0.014045128598809242,
          0.0031645577400922775,
          0.005039044190198183,
          0.03641076385974884,
          0.028397394344210625,
          0.00045074583613313735,
          0.05328204110264778,
          0.004889762960374355,
          0.00020380773639772087,
          0,
          0.014419269748032093,
          0.0200918298214674,
          0.008221576921641827,
          0.01766381785273552,
          0.0012620430206879973,
          0.02596721239387989,
          0.01149029191583395,
          0.013414940796792507,
          0.0602804571390152,
          0.03567330166697502,
          0.0018913476960733533,
          0.025563618168234825,
          0,
          0.002195236971601844,
          0.03377345949411392,
          0.01074524037539959,
          0.019881602376699448,
          0.0410163477063179,
          0.026404211297631264,
          0.027119595557451248,
          0.004520713817328215,
          0.0015704537509009242,
          0.0029046102426946163,
          0.03585171326994896,
          0.007934434339404106,
          0.0029329888056963682,
          0.0009071946842595935,
          0.01995166577398777,
          0.026696426793932915,
          0.058171357959508896,
          0.03711375966668129,
          0,
          0.02003808133304119,
          0.01654999330639839,
          0.09188401699066162,
          0.005605395417660475,
          0.10116403549909592,
          0,
          0.0004827684024348855,
          0.010043780319392681,
          0.027870073914527893,
          0,
          0.00510210869833827,
          0.02869381010532379,
          0.0020657621789723635,
          0.012788242660462856,
          0.0012290950398892164,
          0,
          0.03939131647348404,
          0.008911865763366222,
          0.012061026878654957,
          0.03124568611383438,
          0.018259409815073013,
          0,
          0,
          0.0013450399274006486,
          0.014392679557204247,
          0.000007158597327361349,
          0.008252671919763088,
          0,
          0.02183501608669758,
          0.04987234249711037,
          0.02155780792236328,
          0.0008885553106665611,
          0.03048480488359928,
          0.010128910653293133,
          0.0023221285082399845,
          0.017133625224232674,
          0.002365674590691924,
          0.007406371645629406,
          0.0442444272339344,
          0.03406039625406265,
          0.04289022088050842,
          0.001924423617310822,
          0.07391417771577835,
          0.0016283493023365736,
          0.0013708004262298346,
          0.015313482843339443,
          0.00004800537135452032,
          0.008960283361375332,
          0.001483859377913177,
          0.0430128276348114,
          0.0009881033329293132,
          0.003837972180917859,
          0.030291248112916946,
          0.013475196436047554,
          0.002749577397480607,
          0.0004270843346603215,
          0.06853297352790833,
          0.00563666969537735,
          0.0006853520753793418,
          0.020258216187357903,
          0.019149580970406532,
          0.015702063217759132,
          0,
          0.007635645568370819,
          0.00269525870680809,
          0.008744053542613983,
          0.0015316971112042665,
          0,
          0.02554278075695038,
          0.0015017481055110693,
          0.00815387349575758,
          0.08987200260162354,
          0.019336704164743423,
          0.04154173284769058,
          0.0008290684781968594,
          0.0210060253739357,
          0.009151139296591282,
          0.03981567546725273,
          0.005089023616164923,
          0.05700039863586426,
          0,
          0.00008519001130480319,
          0.020684532821178436,
          0.00773569755256176,
          0,
          0.0045461212284862995,
          0.012116191908717155,
          0.010241995565593243,
          0.0008727620588615537,
          0.02891703136265278,
          0.01974022202193737,
          0.0019428916275501251,
          0.0036932488437741995,
          0.007553138770163059,
          0,
          0.022235652431845665,
          0.02511434815824032,
          0.0009381530690006912,
          0.0005145197501406074,
          0.002011371310800314,
          0.00601563137024641,
          0.026322342455387115,
          0.009425274096429348,
          0.0017616843106225133,
          0.013708576560020447,
          0.049527134746313095,
          0.048113346099853516,
          0.004324056673794985,
          0.026909293606877327,
          0.0856257900595665,
          0.00029254352557472885,
          0,
          0.008552556857466698,
          0,
          0.00842456053942442,
          0.029012110084295273,
          0.04603090137243271,
          0.030970826745033264,
          0.03892241045832634,
          0.012008883990347385,
          0.019124794751405716,
          0.00273174699395895,
          0.05799936130642891,
          0.011207123287022114,
          0.02000783011317253,
          0.033375609666109085,
          0.015801332890987396,
          0.01854618266224861,
          0.008119146339595318,
          0.01652439497411251,
          0.0004124750557821244,
          0.0491865836083889,
          0.06283184885978699,
          0.029957357794046402,
          0.06037626042962074,
          0.01864648051559925,
          0.011109329760074615,
          0.013124780729413033,
          0,
          0.005203564185649157,
          0.052118558436632156,
          0.04332532733678818,
          0.08055371046066284,
          0,
          0.034990232437849045,
          0.0029151514172554016,
          0.010600523091852665,
          0.0036209439858794212,
          0.005052181892096996,
          0.010056146420538425,
          0.0004526483826339245,
          0.009076890535652637,
          0.05775348097085953,
          0.00978409219533205,
          0.004166936036199331,
          0.008468085899949074,
          0.03707746043801308,
          0.007704087998718023,
          0.06603043526411057,
          0.00615199888125062,
          0.02108251303434372,
          0.0016589961014688015,
          0.0334281362593174,
          0.01310361921787262,
          0,
          0.028892338275909424,
          0.07873403280973434,
          0.08393894881010056,
          0.00912774819880724,
          0.005476830992847681,
          0.010377779603004456,
          0,
          0.0012201362987980247,
          0.017402390018105507,
          0.01973598264157772,
          0.03180921822786331,
          0.030336860567331314,
          0.002362398197874427,
          0.016942035406827927,
          0.003358351532369852,
          0.00912653561681509,
          0,
          0.017642969265580177,
          0.0027405298314988613,
          0.004127390682697296,
          0.007053682114928961,
          0.03850530833005905,
          0.05935049057006836,
          0.00008559224079363048,
          0.008648085407912731,
          0.011186014860868454,
          0.006618466228246689,
          0.0012385551817715168,
          0.017971990630030632,
          0.0047562867403030396,
          0.0048309010453522205,
          0,
          0.004230261314660311,
          0.07649614661931992,
          0.03888307139277458,
          0.0685473084449768,
          0.050699181854724884,
          0.010355116799473763,
          0,
          0.0032941072713583708,
          0.006064997520297766,
          0,
          0.008528013713657856,
          0.008584588766098022,
          0.014844642952084541,
          0.053625740110874176,
          0.014434420503675938,
          0,
          0.036251917481422424,
          0.017391273751854897,
          0,
          0.004491334315389395,
          0.0023731417022645473,
          0.10573291778564453,
          0,
          0.0006642939988523722,
          0.00802840106189251,
          0.0006168375839479268,
          0.001252297661267221,
          0.028897777199745178,
          0.024656666442751884,
          0.0023496539797633886,
          0.002212099963799119,
          0.014494613744318485,
          0.013218586333096027,
          0.007327834144234657,
          0.005265493877232075,
          0.011800821870565414,
          0.041674114763736725,
          0.021690810099244118,
          0.007477263454347849,
          0,
          0.003795279422774911,
          0.04592696949839592,
          0.0016299680573865771,
          0.0024693000596016645,
          0.04539627954363823,
          0,
          0,
          0.0025357252452522516,
          0.017552491277456284,
          0,
          0.030132507905364037,
          0.005417125299572945,
          0.014767812564969063,
          0.04490237683057785,
          0.038240447640419006,
          0.012629026547074318,
          0.004733513109385967,
          0.01641431823372841,
          0.007099563255906105,
          0.024187346920371056,
          0.004579119849950075,
          0.02639264240860939,
          0.03136616572737694,
          0.045123156160116196,
          0.020923512056469917,
          0.0018885403405874968,
          0.0036390796303749084,
          0.0037671192549169064,
          0.013212445192039013,
          0.031942225992679596,
          0,
          0.019871564581990242,
          0.0327218696475029,
          0.06675240397453308,
          0.011316879652440548,
          0,
          0.0679059773683548,
          0.003853261237964034,
          0.006573521997779608,
          0.01750727742910385,
          0.02214180678129196,
          0.0012478578137233853,
          0.00288198608905077,
          0,
          0.0034723998978734016,
          0.031161241233348846,
          0.024784604087471962,
          0.017225150018930435,
          0,
          0.000683746300637722,
          0.0073000239208340645,
          0.0028311829082667828,
          0.00521664647385478,
          0.007933552376925945,
          0.056421030312776566,
          0.006301634479314089,
          0.006672449875622988,
          0.006065085995942354,
          0.004292833618819714,
          0.004746125545352697,
          0.010786592029035091,
          0.047994062304496765,
          0.028902333229780197,
          0.015176603570580482,
          0.002047862857580185,
          0.018750926479697227,
          0.05926254391670227,
          0.06109870597720146,
          0.0015141430776566267,
          0.022531304508447647,
          0.003780859522521496,
          0.007809585426002741,
          0.023433061316609383,
          0.0051781414076685905,
          0.05632071569561958,
          0,
          0.011759459972381592,
          0.000023758038878440857,
          0.004067778121680021,
          0.023892512544989586,
          0.012167984619736671,
          0.025631185621023178,
          0.002825116505846381,
          0.020148955285549164,
          0.0034774946980178356,
          0.0094177620485425,
          0.00039043667493388057,
          0.023300906643271446,
          0.007861096411943436,
          0.0991668626666069,
          0.001783737214282155,
          0.048148609697818756,
          0.0023882430978119373,
          0.013721230439841747,
          0.001181960222311318,
          0.00364687223918736,
          0.07291513681411743,
          0,
          0.0026407530531287193,
          0,
          0,
          0.019153112545609474,
          0.0039291600696742535,
          0.0013644600985571742,
          0.0009573393035680056,
          0.006986333057284355,
          0.017538510262966156,
          0.07654639333486557,
          0,
          0.02134065516293049,
          0,
          0.03213260695338249,
          0.07240711897611618,
          0.028054529801011086,
          0.00014977407408878207,
          0.00006557349115610123,
          0.003933075815439224,
          0.05342208594083786,
          0.024439888074994087,
          0.01858861930668354,
          0.018257329240441322,
          0.037394747138023376,
          0.010644867084920406,
          0.012784726917743683,
          0.007593278307467699,
          0.015125573612749577,
          0.023480314761400223,
          0.00002698402022360824,
          0.06509353220462799,
          0,
          0.0880088284611702,
          0.028307024389505386,
          0.009194321930408478,
          0.008127202279865742,
          0.007888502441346645,
          0,
          0.000004898155566479545,
          0.08987759798765182,
          0.05994053930044174,
          0.012979251332581043,
          0,
          0.04516533762216568,
          0.05857207626104355,
          0.01651587150990963,
          0.002980723511427641,
          0.034203361719846725,
          0.03269444406032562,
          0.03494073078036308,
          0.00023634772514924407,
          0.01028406247496605,
          0.02318665385246277,
          0.0013659499818459153,
          0.021092509850859642,
          0.01703183352947235,
          0,
          0.011204659938812256,
          0.00415118969976902,
          0.002481940435245633,
          0.011684496887028217,
          0.005828259512782097,
          0.02265380509197712,
          0.021472154185175896,
          0.005200440529733896,
          0.01608005166053772,
          0.026152705773711205,
          0.03877837955951691,
          0.0023407554253935814,
          0.020472567528486252,
          0.012522089295089245,
          0,
          0.04476510360836983,
          0.005661794450134039,
          0.01013703178614378,
          0,
          0.006358365993946791,
          0.003198753809556365,
          0.022212421521544456,
          0.010457569733262062,
          0.00792034063488245,
          0.003515837248414755,
          0.020811375230550766,
          0.005390291567891836,
          0.0070398724637925625,
          0.011326967738568783,
          0.011162788607180119,
          0.031561244279146194,
          0.004164252430200577,
          0.029029112309217453,
          0.04919271171092987,
          0.005823174957185984,
          0.03659789264202118,
          0.020832153037190437,
          0,
          0.01191479992121458,
          0.01764492690563202,
          0.027052655816078186,
          0.027581775560975075,
          0.03250693157315254,
          0,
          0,
          0,
          0.07151991128921509,
          0.025573289021849632,
          0.028687041252851486,
          0.01763029582798481,
          0.026991302147507668,
          0.035939719527959824,
          0.09944576025009155,
          0.01584840752184391,
          0.018940839916467667,
          0,
          0.06201695650815964,
          0.024903681129217148,
          0.0055382708087563515,
          0.01078372448682785,
          0.0007917593466117978,
          0.03927331417798996,
          0.07134953141212463,
          0.03119545243680477,
          0.045353103429079056,
          0.04763375222682953,
          0.005840477999299765,
          0.02822710946202278,
          0,
          0.0009302297257818282,
          0.00743908854201436,
          0.056708160787820816,
          0.00044703567982651293,
          0.010277311317622662,
          0.0006441862788051367,
          0.0014871499733999372,
          0,
          0.035319507122039795,
          0,
          0.08178652077913284,
          0,
          0.00015240140783134848,
          0,
          0.030125487595796585,
          0.0007903303485363722,
          0.0009386246092617512,
          0.0007164967828430235,
          0.02984970435500145,
          0.016180861741304398,
          0.06519019603729248,
          0.009573847986757755,
          0.0378224179148674,
          0.032492637634277344,
          0.007328057195991278,
          0.0015994353452697396,
          0.044447604566812515,
          0.0386652797460556,
          0.020219484344124794,
          0.0024255244061350822,
          0.03972497209906578,
          0.014537353999912739,
          0.007890027947723866,
          0.02506779506802559,
          0.0011780563509091735,
          0,
          0.015084630809724331,
          0.03753363713622093,
          0,
          0,
          0.005667140707373619,
          0.008533589541912079,
          0.034876808524131775,
          0.041589509695768356,
          0.006457543466240168,
          0.004881370812654495,
          0.028009017929434776,
          0,
          0.0200009997934103,
          0.04523381590843201,
          0.035353582352399826,
          0.02053208090364933,
          0.052104685455560684,
          0,
          0.022627711296081543,
          0.001461148844100535,
